export const cssdata = [
    {
        id:1,
        title:'সিএসএস বাংলা টিউটোরিয়াল - CSS Tutorials',
        category:'সিএসএস',
        desc:[
            'একটা সময় ছিল যখন শুধুমাত্র এইচটিএমএল দিয়েই ওয়েব পেজ তৈরি করা হত, তখন ওয়েব পেজে খুব সামান্যই ডিজাইন এর কাজ করা যেত। কিন্তু সময়ের সাথে সাথে ওয়েব পেজের গুনগত মান বৃদ্ধি ও দৃষ্টিনন্দন করার প্রয়োজনীয়তা বৃদ্ধি পায়।',
            'ওয়েব পেজকে দৃষ্টিনন্দন এবং ইউজার ফ্রেন্ডলি করার জন্যই সিএসএস এর উদ্ভব হয়েছে। এইচটিএমল ডকুমেন্টের যেকোন এলিমেন্টকে খুব সহজে সাজাতে বা styleing করতে সিএসএস ব্যবহার হয়। সিএসএস ব্যবহার করে বেশ কম সময় ও কম পরিশ্রমে অনেক বেশী কাজ করা যায়।'
        ],
        titleTwo: [
            {
                head:'সিএসএস টেমপ্লেট',
                text:[`আপনার সহজ অনুশীলনের জন্য আমরা তৈরি করেছি সিএসএস বাবহ্রিত ওয়েব টেমপ্লেট। এই ওয়েব টেমপ্লেট গুলো বাবহারের ফলে আপনি সিএসএস এর বাস্তব ব্যবহার সম্পর্কে জ্ঞান অর্জন করতে পারবেন।

                তাহলে, চলুন শুরু করি " সিএসএস বাংলা টিউটোরিয়াল "।`]
            },
            {
                head:'টেক্সট এডিটর',
                text:[`সিএসএস এর এই কোড গুলো লিখতে ও সিএসএস ফাইল তৈরি করার জন্য আমাদের একটি কোড এডিটর ব্যবহার করেত হবে।

                vs code ,atom, node pad "।`,`সিএসএস এর এই কোড গুলো লিখতে ও সিএসএস ফাইল তৈরি করার জন্য আমাদের একটি কোড এডিটর ব্যবহার করেত হবে।

                vs code ,atom, node pad "।`]
            }
        ]
    },
    {
        id:2,
        title:'সিএসএস কি ?',
        category:'সিএসএস কি',
        desc:[
            'css এর পূর্ণরুপ হল Cascading Style Sheet,',
            'style নির্দিষ্ট করে ওয়েবে কন্টেন্টগুলো কিভাবে প্রদর্শিত হবে,',
            'style নির্দিষ্ট করে ওয়েবে কন্টেন্টগুলো কিভাবে প্রদর্শিত হবে,',
            'extarnal style sheet আনেক সহজ ও সময় বাচায়,',
            'extarnal style গুলো রাখা হয় css file এ,',
        ],
        titleTwo: [
            {
                head:'আপনি কি জানেন ?',
                text:[`আপনি কি এইচটিএমএল অথবা এক্সএইচটিএমএল সম্পর্কে জানেন? কারন সিএসএস সম্পর্কে জানার আগে আপনাকে এইচটিএমএল ৪.০১ বা এইচটিএমএল ৫.০ অথবা এক্সএইচটিএমএল সম্পর্কে ভালভাবে জানতে হবে।`]
            },
            {
                head:'সিএসএস এর ইতিহাস',
                text:[`অক্টোবর ১০, ১৯৯৪ সালে Håkon Wium Lie প্রথম সিএসএস তৈরি করার প্রস্তাব করে। একিই সময়ে Håkon Wium, Tim Berners-Lee এর সাথে European Organization for Nuclear Research (CERN), Switzerland এ কাজ করছিলেন।`,
                `প্রায় এই রকম স্টাইল সিট প্রনয়ন করার জন্য বিভিন্ন জায়গা থেকে প্রস্তাবনা আসছিল, যে গুলো সংশ্লিষ্ট বিভিন্ন মহলে মেইল এর মাধ্যমে এবং World Wide Web Consortium এর অভ্যন্তরে আলোচিত হয়ে আসছিল।`,
            `অবশেষে ১৯৯৬ সালে, World Wide Web Consortium কতৃক W3C সমর্থিত CSS1 প্রকাস করা হয়। CSS1 প্রস্তাবনা এবং প্রনয়নের ক্ষেত্রে Bert Bos এর যথেষ্ট কার্যকর ভুমিকা ছিল, তাই Bert Bos কে CSS1 এর co-author বলা হয় এবং তাকে সিএসএস এর co-creator রুপে সম্মানিত করা হয়।`
        ]
            }
        ]
    },
    {
        id:3,
        title:'সিএসএস সিনট্যাক্স - Css Syntax',
        category:'সিএসএস সিনট্যাক্স',
        desc:[
            'সিএসএস এর স্টাইল কোড লেখার কৌশল বা নিয়মই হল সিএসএস সিনট্যাক্স।',
            
        ],
        titleTwo: [
            {
                head:'সিএসএস সিনট্যাক্স',
                            text:[`যে পদ্ধতি বা নিয়ম অনুসরণ করে সিএসএস এর স্টাইল কোড গুলো এইচটিএমএল এলিমেন্টে প্রয়োগ করা হয়, তাকেই সিএসএস সিনট্যাক্স বলে। একটি সিএসএস সিনট্যাক্স, যা ২ টি অংশ নিয়ে গঠিত হয়, এর একটি হল সিএসএস selector এবং অন্যটি হল declaration.`,
                        `এখানে, সিএসএস selector অংশটি হল, যে এইচটিএমএল এলিমেন্টে স্টাইল কোড প্রয়োগ করা হবে, তার নাম, এটা হতে পারে, এক বা একাধিক ID বা Class এর নাম, বা সাধারণ ভাবে কোন এইচটিএমএল এলিমেন্ট, যেমন -h1,p ইত্যাদি। অর্থাৎ seclector হল এইচটিএমএল এলিমেন্ট বা এইচটিএমএল ট্যাগ, যার স্টাইল সিএসএস এর মাধ্যমে নির্ধারণ করা হবে।`,
                    `declaration অংশটি হল, যেখানে এইচটিএমএল এলিমেন্ট বা ট্যাগের জন্য স্টাইল কোড গুলো লেখা হবে। এই অংশে একটি এইচটিএমএল এলিমেন্টের জন্য এক বা একাধিক স্টাইল কোড লেখা যায়।
                    প্রতিটি declaration এর আবার ২ টি অংশ আছে, একটি স্টাইল প্রপার্টি এবং অন্যটি তার মান বা value.প্রপার্টি হল style attribute, যার সাহায্যে স্টাইল এর ধরন নির্বাচন করা হয় এবং value হল সেই style attribute এর মান যার দ্বারা স্টাইলের পরিমান নির্ধারণ করা হয়।`,
                `সিএসএস seclector এর সাথে স্টাইলিং প্রপার্টি ব্যবহার করার জন্য দ্বিতীয় বন্ধনী বা secound bracket অর্থাৎ " { } " চিহ্ন ব্যবহার করা হয়।
                একটি seclector এর সাথে একাধিক style attribute ব্যবহার করা যায়, তবে প্রতিটি স্টাইল প্রপার্টির মানের শেষে একটি কোলন অর্থাৎ " ; " চিহ্ন ব্যবহার করে প্রতিটি স্টাইল প্রপার্টিকে আলাদা করা হয়।`]
            },
            {
                head:'সিনট্যাক্স এর ব্যবহার',
                text:[`নিচে একটি উদাহরণ দেখুন, এখানে এইচটিএমএল <h1> ট্যাগের জন্য সিএসএস স্টাইল কোড লেখা হয়েছে।`
           

        ],
        input:[
            `উদাহরণ `,
           ` h1 { `,
            `  color: teal;`,
            `  text-align: right; ` ,
          `}`,
            
             
            
        ],
            },
            {text: [`নিচে একটি উদাহরণ দেখুন, এখানে ভিন্ন ভিন্ন এইচটিএমএল ট্যাগের জন্য অর্থাৎ <h1> ও <p> ট্যাগের জন্য একই সিএসএস স্টাইল কোড ব্যবহার করা হয়েছে।`,],
           
            input:[
                `উদাহরণ `,
                ` h1, p { `,
                  `color: red;`, 
                 ` text-align: right; `,
                  `}`,
               ]
        },
          
            {
                head:'সিএসএস কোড কোথায় লিখবেন?',
                text:[`সিএসএস লেখার জন্য উইন্ডোজ এর সাধারণ নোটপ্যাডই যথেষ্ট, তবে আরও কিছু বেশি সুবিধা পাওয়ার জন্য বিভিন্ন এডিটিং সফটওয়্যার যেমন Notepad++, Notepad2, NetBeans ইত্যাদি ব্যবহার করাই উত্তম।
                সিএসএস বিভিন্ন ভাবে লেখা যায়। যেমন বহিঃস্থ স্টাইল সীট এইচটিএমএল ডকুমেন্টের সাথে লিংক করে বা এইচটিএমএল ডকুমেন্ট এর ভেতরে <style> ট্যাগ ব্যবহার করে।`
                
        ]
            }
        ]
    },
    {
        id:4,
        title:'সিএসএস ব্যবহার পদ্ধতি - Css Method Of Use',
        category:'সিএসএস ব্যবহার',
        desc:[
            'ওয়েব পেজে বিভিন্ন ভাবে সিএসএস স্টাইল কোড ব্যবহার করা যায়। বিভিন্ন পদ্ধতি বিভিন্ন ক্ষেত্রে ব্যবহার করা সুবিধাজনক।',
            
        ],
        titleTwo: [
            {
                head:'সিএসএস ব্যবহার পদ্ধতি',
                            text:[`৩ টি পদ্ধতিতে কোন ওয়েব পেজে সিএসএস স্টাইল কোড ব্যবহার করা যায়। এগুলো হল -`,
                        `Inline style ব্যবহার করে,`,
                        `External style sheet ব্যবহার করে,`,
                        `Internal style ব্যবহার করে।`]
            },
            {
                head:'Inline সিএসএস',
                text:[`কেবল মাত্র একটি এইচটিএমএল এলিমেন্টে কোন সিএসএস স্টাইল কোড ব্যবহার করার জন্য বা কোন এইচটিএমএল এলিমেন্টে ভিন্ন ভিন্ন স্টাইল ব্যবহার করার জন্য এই পদ্ধতি ব্যবহার করা হয়। তবে এই পদ্ধতিতে ভুল হওয়ার সম্ভাবনা বেশী থাকে`,
            `ইনলাইন স্টাইল ব্যবহার করার জন্য, যে এইচটিএমএল এলিমেন্টে স্টাইল করা হবে, ঐ ট্যাগের সাথে style এট্রিবিউট ব্যবহার করতে হয়। style এট্রিবিউট যে কোন সিএসএস প্রপার্টির সাথে ব্যবহার করা যায়।`,
              `style এট্রিবিউট ব্যবহার করে নিচে একটি উদাহরণ দেখুন।`,
             

        ],
        input:[
            `উদাহরণ`,
            `<h2 style="color:teal;margin-left:30px;">This is a heading.</h2>`,
            `<p style="color:blue;margin-left:20px;">This is a`,
        ]
            },
            {
                head:'External সিএসএস',
                text:[`যখন একই স্টাইল কোড একাধিক ওয়েব পেজ বা এইচটিএমএল ডকুমেন্ট ব্যবহার করার প্রয়োজন হয় তখন এক্সটারনাল স্টাইল সীট পদ্ধতি ব্যবহার করাই উত্তম। প্রতিটি ওয়েব পেজেই অবশ্যই <link> ট্যাগের মাঝে href আত্ত্রিবুত ব্যবহার করে এক্সটারনাল স্টাইল সীট যুক্ত করে দিতে হয়। এক্ষেত্রে <link> ট্যাগটি অবশ্যই <head> . . . </head> ট্যাগ অর্থাৎ head সেকশনের মাঝে রাখতে হয়।`,
                `নিচে একটি উদাহরণ দেখুন।`,
                
               
               
                
        ],
        input:[
            `উদাহরণ`,
               ` <head>`,
                  `<link rel="stylesheet" type="text/css" href="mystyle.css" />`,
               ` </head>`,
               ` <body>`,
               ` <p>`,
               ` w3school.com is a tuitorial website.`,
               ` </p>`,
                `</body>`,
        ]
            },
            {
                text:[ `সিএসএস স্টাইল সীটে কোন এইচটিএমএল ট্যাগ থাকবে না। স্টাইল সীটকে একটি .css এক্সটেনশন যুক্ত "mystyle" নামে একটি file এ সংরক্ষণ বা save করা হয়েছে। ওপরের এইচটিএমএল কোডের জন্য নিচে mystyle.css স্টাইল সীটের নমুনা দেয়া হল -`],
                input:[
                    `উদাহরণ`,
                  `  body {`,
                     ` background-color: gray;`,
                   `   }`,
                    
                  `  p {`,
                     ` color: red;`,
                     `  font-size: 20px;`,
                     ` text-decoration: underline;`,

                     ` }`
                ]
            },
            {
                head:'Internal সিএসএস',
                text:[`যদি এক ধরনের স্টাইল শুধুমাত্র একটি ওয়েব পেজ বা এইচটিএমএল ডকুমেন্টে ব্যবহার করার জন্য প্রয়োজন হয় তবে সেক্ষেত্রে ইন্টারনাল স্টাইল পদ্ধতি ব্যবহার করাই উত্তম। ইন্টারনাল স্টাইল সীট প্রকাশ করা হয় এইচটিএমএল ডকুমেন্টের <head> ট্যাগের ভেতরে, <style> ট্যাগ ব্যবহার করে।`,
                `নিচে এর একটি উদাহরণ দেখুন।`,
        
               
                
        ],
        input:[
            `উদাহরণ`,
          `  <head>`,
             ` <style type="text/css">`,
           `  body {background-color:yellow;}`,
            
          `  p {`,
             ` color: red;`,
             ` }`,
             `  </style>`,
             ` </head>`
        ]
            },
            {
                head:'একাধিক স্টাইলিং পদ্ধতির ব্যবহার',
                text:[`একই ওয়েব পেজে একাধিক পদ্ধতিতে স্টাইল কোড ব্যবহার করা যায়। আবার একটি এইচটিএমএল ডকুমেন্টই একাধিক external স্টাইল সীট ব্যবহার করা যায়।`,
                `নিচে এর একটি উদাহরণ দেখুন।`,
                
               
                
        ],
        input:[
            `উদাহরণ`,
            `<html>`,
              `<head>`,
               ` <link rel="stylesheet" type="text/css" href="mystyle.css">`,
                `<style>`,
               ` h1 {`,
                   `color: lime;`,
                `   }`,
             `   </style>`,
             ` </head>`,
            `  <body>`,
                `<h1> This is a heading. </h1>`,
                `<p> This is a paragraph. </p>`,
              `</body>`
        ]
            }
        ]
    },
    {
        id:5,
        title:'সিএসএস সিলেক্টর - CSS Silector',
        category:'সিএসএস সিলেক্টর',
        desc:[
            'এইচটিএমএল এলিমেন্ট গুলো স্টাইল করতে সিএসএস সিলেক্টর এর ব্যবহার বেস গুরুত্বপূর্ণ। এই অধ্যায়ে সিএসএস এর বিভিন্ন সিলেক্টর সম্পর্কে আলোচনা করা হয়েছে।',
            
        ],
        titleTwo: [
            {
                head:'সিএসএস সিলেক্টর',
                            text:[`যে সকল এইচটিএমএল এলিমেন্টে স্টাইল কোড প্রয়োগ করতে হবে, সে গুলো কে খুজে পেতে বা নির্ধারণ করতে সিএসএস সিলেক্টর ব্যবহার করা হয়। অর্থাৎ কোন এইচটিএমএল এলিমেন্টকে, নির্দিষ্ট ভাবে নির্ধারণ করে তাতে স্টাইল কোড প্রয়োগ করার পদ্ধতিটিই হল সিএসএস সিলেক্টর।`,
                        `নিচে একটি সাধারণ সিএসএস সিলেক্টর এর উদাহরণ দেখুন।`,
                        
                        ],
                        input:[
                            `উদাহরণ`,
                       ` <head> `,
                       ` <style>`,
                       ` p {`,
                         ` color     : red;`,
                         ` text-align: center;`,
                         ` }`,
                        `</style>`,
                       ` </head>`,
                       ` <body>`,
                        
                        ` <p">This is a paragraph working with two diffrent style code.</p>`,
                        
                        `</body>`
                        ]
            },
            {
                head:'সিলেক্টর এর প্রকারভেদ',
                text:[`ব্যবহারের ওপর নির্ভর করে সিএসএস সিলেক্টর গুলোকে বিভিন্ন ভাগে ভাগ করা যায়। নিচে এগুলো দেখুন।`,
            `সাধারণ সিলেক্টর`,
              `গ্রুপ সিলেক্টর`,
              `সার্বজনীন সিলেক্টর`,
              `ক্লাস সিলেক্টর,`,
              `আইডি সিলেক্টর,`,
              `এছাড়াও আরও কিছু সিলেক্টর আছে, যেমন - সিডো-ক্লাস সিলেক্টর, সিডো-এলিমেন্ট সিলেক্টর, এট্রিবিউট সিলেক্টর ইত্যাদি এগুলো সিএসএস টিউটোরিয়াল এর অ্যাডভান্সড অংশে আলোচনা করা হয়েছে।`

        ]
            },
            {
                head:'সাধারণ সিলেক্টর',
                text:[`এইচটিএমএল এলিমেন্টের নাম অর্থাৎ ট্যাগকেই সিএসএস সিলেক্টর রুপে ব্যবহার করে সিএসএস স্টাইল নির্ধারণ করা যায়।`,
                `নিচে একটি উদাহরণ দেখুন, যেখানে কেবল এইচটিএমএল ট্যাগ অর্থাৎ h1 ও p ট্যাগকে সিএসএস সিলেক্টর হিসেবে ব্যবহার করা হয়েছে।`,
                
                
        ],
        input:[
            `উদাহরণ`,
               ` h1 {`,
                  ` color     : blue;`,
                  ` text-align: center;`,
                  ` }`,
                   
              ` p {` ,
                `   color     : red;`,
                 `  text-align: right;`,
                   `}`
        ]
            },
            {
                head:'গ্রুপ সিলেক্টর',
                text:[`একিই রকম স্টাইল কোড গুলো, ভিন্নি ভিন্ন রকমের এইচটিএমএল এলিমেন্টে ব্যবহার করার জন্য সিএসএস গ্রুপ সিলেক্টর ব্যবহার করা হয়। স্টাইল কোড গুলোর শুরুর দিকে দ্বিতীয় বন্ধনী বা secound braket " { } " এর বাইরে এইচটিএমএল সিলেক্টর গুলোর নাম লিখে এই গ্রুপ সিলেক্টর তৈরি করা হয়। এইচটিএমএল সিলেক্টর গুলোর নামের মাঝে কমা বা comma " , " ছিনহ ব্যবহার করে নাম গুলো আলাদা করে দেয়া হয়।`,
                `নিচে একটি উদাহরণ দেখুন, যেখানে স্টাইল কোড গুলো ওয়েব পেজের নির্ধারিত এইচটিএমএল এলিমেন্টের ক্ষেত্রে প্রযোজ্য হবে।`,
               
               
                
        ],
        input:[
            `উদাহরণ`,
          `  h1, h2, p {`,
              ` color     : blue;`,
           `    text-align: center;`,
               `}`,
        ]
            },
            {
                head:'সার্বজনীন সিলেক্টর',
                text:[`কোন ওয়েব পেজে থাকা সকল এলিমেন্ট এর জন্য নির্দিষ্ট কিছু স্টাইল নির্ধারণ করতে সিএসএস এর সার্বজনীন বা Universal সিলেক্টর পদ্ধতি ব্যবহার করা হয়।`,
                `স্টাইল কোড গুলোর প্রথমে দ্বিতীয় বন্ধনী বা secound braket " { } " এর বাইরে একটি তারকা বা star " * " ছিনহ ব্যবহার করে Universal সিলেক্টর তৈরি করা হয়।`,
               `নিচে একটি উদাহরণ দেখুন, যেখানে স্টাইল কোড গুলো ওয়েব পেজের সকল এলিমেন্টে প্রযোজ্য হবে।`,
              
                
                
        ],
        input:[
            `উদাহরণ`,
           ` * {`,
            `  margin: 25px;`,
              `padding:30px;`,
              `}`
        ]
            },
            {
                head:'ক্লাস সিলেক্টর',
                text:[`এইচটিএমএল এর যে কোন ট্যাগের সাথে class আত্ত্রিবুতে ব্যবহার করে ক্লাস সিলেক্টর তৈরি করা হয়। নিচে class আত্ত্রিবুতে এর একটি উদাহরণ দেখুন।`,
                
              
                
                
        ],
        input:[
            `উদাহরণ`,
               ` <head>`,
               ` <style>`,
               ` .paragraph {`,
                  ` color     : red;`,
                 `  text-align: center;`,
                  ` }`,
                `</style>`,
                `</head>`,
                `<body>`,
                
                 `<p class="paragraph">This is a paragraph working with class selector.</p>`,
                
                `</body>`
        ]
            },
            {
                head:'আইডি সিলেক্টর',
                text:[`এএইচটিএমএল এর যে কোন ট্যাগের সাথে id আত্ত্রিবুতে ব্যবহার করে আইডি সিলেক্টর তৈরি করা হয়। নিচে id আত্ত্রিবুতে এর একটি উদাহরণ দেখুন।`,
               
              
                
                
        ],
        input:[
            `উদাহরণ`,
               ` <head>`,
               ` <style>`,
               ` #paragraph {`,
                  ` color     : red;`,
                 `  text-align: center;`,
                  ` }`,
                `</style>`,
                `</head>`,
                `<body>`,
                
                 `<p id="paragraph">This is a paragraph working with class selector.</p>`,
                
                `</body>`
        ]
            }
        ]
    },
    {
        id:6,
        title:'সিএসএস ক্লাস - CSS Class',
        category:'সিএসএস ক্লাস',
        desc:[
            'এইচটিএমএল ডকুমেন্টের বিভিন্ন এলিমেন্টকে নির্দিষ্ট ভাবে স্টাইলিং করার জন্য সিএসএস এর class আত্ত্রিবুতে ব্যবহার করা হয়।',
            
        ],
        titleTwo: [
            {
                head:'Class Attribute',
                            text:[`ওয়েব পেজের নির্দিষ্ট কতগুলো এইচটিএমএল এলিমেন্টের স্টাইল প্রকাশ করার জন্য class সিলেক্টর ব্যবহার করা হয়। সাধারনভাবে class আত্ত্রিবুতে ব্যবহার করার নিয়মটি হল প্রথমে ডট বা " . " চিহ্ন দিয়ে পরে ক্লাসের নাম লিখতে হবে এবং তারপরে তৃতীয় বন্ধনীর মধ্যে স্টাইলের জন্য সিএসএস কোড লিখতে হয়।`,
                        `নিচে একটি উদাহরণ দেখুন, যেখানে paragraph নামক একটি ক্লাস যুক্ত p ট্যাগের জন্য সিএসএস স্টাইল কোড দেয়া হল।`,
                       
                          
                        ],input:[
                            `উদাহরণ`,
                           ` p.paragraph {`,
                              ` color     :red;`,
                            `   text-align:center;`,
                               `}`,
                        ]
            },
            {
                text:[ `সিএসএস স্টাইল কোডে সিএসএস সিলেক্টর অর্থাৎ class এর সাথে এইচটিএমএল ট্যাগ উল্লেখ না করলেও চলে। যেমন ওপরের উদাহরণে p ট্যাগ উল্লেখ না করলেও হবে। নিচে এমন উদাহরণ দেখুন।`],
                input:[

                    `উদাহরণ`,
                  `  .paragraph {`,
                      ` color     :red;`,
                    `  text-align:center;` ,
                      ` }`
                ]
                        },
            {
                head:'একাধিক এলিমেন্টে ব্যবহার',
                text:[`একই নামের class যুক্ত সকল এইচটিএমএল এলিমেন্টে ঐ স্টাইল কোড প্রযোজ্য হবে। নিচে একটি উদাহরণ দেখুন, যেখানে paragraph নামক ক্লাস যুক্ত সকল এইচটিএমএল এলিমেন্ট এই স্টাইল কোড কাজ করবে।`,
            
              

        ],
        input:[
            `উদাহরণ`,
           `<head>` ,
            `<style>`,
          `  .paragraph {`,
              ` color     :red;`,
             `  text-align:center;`,
              ` }`,
         `   </style>`,
           ` </head>`,
          `  <body>`,
           ` <p class="paragraph">This is a paragraph.</p>`,
           ` <p class="paragraph">This is another paragraph.</p>`,
            `</body>`
        ]
            },
            {
                head:'একাধিক ক্লাসের ব্যবহার',
                text:[`কোন একটি এইচটিএমএল এলিমেন্টে একাধিক class ব্যবহার করা যায়। প্রতিটি class এর নাম আলাদা করার জন্য class নাম গুলোর মাঝে একটি ফাঁকা স্থান বা space দেয়া হয়।`,
                `নিচে একটি উদাহরণ দেখুন, যেখানে একটি এইচটিএমএল p ট্যাগে one এবং two নামে দুইটি ভিন্ন নামের ক্লাস যুক্ত স্টাইল কোড প্রযোজ্য হয়েছে।`
               
                
                
        ],input:[
            `উদাহরণ`,
          
            `<style>`,
           `  .one {`,
              ` color     :red;`,
             `  text-align:center;`,
              ` }`,
              `  .two {`,
              ` font-size      : 16px;`,
             `   text-decoration: bold;`,
              ` }`,
         `   </style>`,
           
          `  <body>`,
           ` <p class="one two">This is a paragraph working with two diffrent style code.</p>`,
         
            `</body>`
        ]
            },
            
            
           
        ]
    },
    {
        id:7,
        title:'সিএসএস আইডি - CSS Id',
        category:'সিএসএস আইডি',
        desc:[
            'এইচটিএমএল ডকুমেন্টের বিভিন্ন এলিমেন্টকে সুনির্দিষ্ট ভাবে স্টাইলিং করার জন্য সিএসএস এর id আত্ত্রিবুতে ব্যবহার করা হয়।',
            
        ],
        titleTwo: [
            {
                head:'ID Attribute',
                            text:[`ওয়েব পেজের কোন সুনির্দিষ্ট একটি এইচটিএমএল এলিমেন্টের স্টাইল প্রকাশ করার জন্য id সিলেক্টর ব্যবহার করা হয়। সাধারনভাবে id আত্ত্রিবুতে ব্যবহার করার নিয়মটি হল প্রথমে হ্যাঁস বা " # " চিহ্ন দিয়ে পরে আইডির নাম লিখতে হবে এবং তারপরে তৃতীয় বন্ধনীর মধ্যে স্টাইলের জন্য সিএসএস কোড লিখতে হয়।`,
                        `নিচে একটি উদাহরণ দেখুন, যেখানে paragraph নামক একটি আইডি যুক্ত p ট্যাগের জন্য সিএসএস স্টাইল কোড দেয়া হল।`,
                       
                          
                          
                        ],
                        input:[
                            `উদাহরণ`,
                         `   p#paragraph {`,
                               `color     :red;`,
                               `text-align:center;`,
                               `}`,
                        ]
            },
            {
                text:[ `সিএসএস স্টাইল কোডে সিএসএস সিলেক্টর অর্থাৎ id এর সাথে এইচটিএমএল ট্যাগ উল্লেখ না করলেও চলে। যেমন ওপরের উদাহরণে p ট্যাগ উল্লেখ না করলেও হবে। নিচে এর উদাহরণ দেখুন।`,],
                input:[
                    `উদাহরণ`,
                 `   #paragraph {`,
                       `color     :red;`,
                       `text-align:center;`,
                       `}`,
                ]
            },
            {
                head:'একাধিক আইডি ব্যবহার',
                text:[`কোন একটি এইচটিএমএল এলিমেন্টে একাধিক id ব্যবহার করা যায়। প্রতিটি id এর নাম আলাদা করার জন্য id নাম গুলোর মাঝে একটি ফাঁকা স্থান বা space দেয়া হয়।`,
                `নিচে একটি উদাহরণ দেখুন, যেখানে একটি এইচটিএমএল p ট্যাগে one এবং two নামে দুইটি ভিন্ন নামের আইডি যুক্ত স্টাইল কোড প্রযোজ্য হয়েছে।`,
           

        ],
        input:[
            `উদাহরণ`,
           ` <head>`,
           ` <style>`,
            `#one {`,
               `color     : red;`,
              ` text-align: center;`,
               `}`,
          `  #two {`,
            `   font-size      : 16px;`,
           `    text-decoration: bold;`,
               `}`,
           ` </style>`,
           ` </head>`,
           ` <body>`,
            
             `<p id="one two">This is a paragraph working with two diffrent style code.</p>`,
            
            `</body>`
              
        ]
            },
            {
                head:'একাধিক ক্লাসের ব্যবহার',
                text:[`কোন একটি এইচটিএমএল এলিমেন্টে একাধিক class ব্যবহার করা যায়। প্রতিটি class এর নাম আলাদা করার জন্য class নাম গুলোর মাঝে একটি ফাঁকা স্থান বা space দেয়া হয়।`,
                `নিচে একটি উদাহরণ দেখুন, যেখানে একটি এইচটিএমএল p ট্যাগে one এবং two নামে দুইটি ভিন্ন নামের ক্লাস যুক্ত স্টাইল কোড প্রযোজ্য হয়েছে।`,
               
                
        ],
        input:[
            `উদাহরণ`,
           ` <head>`,
           ` <style>`,
            `.one {`,
               `color     : red;`,
              ` text-align: center;`,
               `}`,
          `  .two {`,
            `   font-size      : 16px;`,
           `    text-decoration: bold;`,
               `}`,
           ` </style>`,
           ` </head>`,
           ` <body>`,
            
             `<p id="one two">This is a paragraph working with two diffrent style code.</p>`,
            
            `</body>`
              
        ]
            }
            
            
           
        ]
    },
    {
        id:8,
        title:'সিএসএস কমেন্ট - CSS Comment',
        category:'সিএসএস কমেন্ট',
        desc:[
            'সিএসএস কমেন্ট ট্যাগ ব্যবহার করে সিএসএস স্টাইল শিটে কোন নোট রাখা হয়।',
            
        ],
        titleTwo: [
            {
                head:'সিএসএস কমেন্ট',
                            text:[`সিএসএস স্টাইল সীট এ স্টাইল কোড ব্যাখ্যা করার জন্য বা কোন স্টাইল কোডের জন্য, কোডের সাথে কোন নোট রাখতে কিংবা ভবিষ্যতে কোড পরিবর্তন বা edit করার সময় সহজে সেগুলো খুজে পাওয়ার জন্য কমেন্ট ব্যবহার করা হয়। কমেন্টে লেখা সমস্ত কিছুই সকল ব্রাউজার উপেক্ষা বা ignore করে।`,
                        `সিএসএস কমেন্ট সুরু হয় " /* " চিহ্ন দিয়ে এবং শেষ হয় " */ " চিহ্ন দিয়ে।`,
                        `নিচে সিএসএস কমেন্টের উদাহরণ দেখুন: -`,
                        
                          
                           
                            
                            
                        ],
                        input:[
                            `উদাহরণ`,
                      `  /*This is a css comment*/`,
                      `  p {`,
                          `text-align :center;`,
                          `color      :black;`,
                          `font-family:arial;`,
                          `}`,
                        ]
            },
            {
                text:[ `সিএসএস স্টাইল শিটের যে কোন স্থানে কোন কমেন্ট লেখা যায়, এমন কি কোন স্টাইল প্রপার্টির মাঝখানেও। নিচে এর একটি উদাহরণ দেখুন।
                `,],
                input:[
                    `উদাহরণ`,
                                `   p {`,
                                   `  text-align :center;`,
                                    ` color      :black; /*This is a css comment*/`,
                                     `font-family:arial;`,
                                     `}`,
                ]
            },
            
            {
                text:[ ` সিএসএস স্টাইল শিটে একাধিক লাইনের কমেন্ট লেখা যায়। নিচে এর একটি উদাহরণ দেখুন।`,
                ,],
                input:[
                    `উদাহরণ`,
                                `   p {`,
                                   `  text-align :center;`,
                                    ` color      :black; /*This is a css comment*/`,
                                     `font-family:arial;`,
                                     `}`,
                ]
            },
            
           
        ]
    },
  
   
    {
        id:9,
        title:'সিএসএস রঙ - Css Colou',
        category:'সিএসএস রঙ',
        desc:[
            'কোন কিছুর ডিজাইন বা স্টাইল করার জন্য রঙ সর্বাপেক্ষা প্রধান বিবেচ্য বিসয়। এই অধ্যায়ে কোন এইচটিএমএল এলিমেন্টের রঙ পরিবর্তন বা রঙ নির্ধারণ করা নিয়ে আলোচনা করা হয়েছে।',
            
        ],
        titleTwo: [
            {
                head:'color প্রপার্টি',
                            text:[`সিএসএস এর color প্রপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্টের রঙ পরিবর্তন করা যায়।`,
                        `নিচে একটি উদাহরণ দেখুন, যেখানে color প্রপার্টি ব্যবহার করে এইচটিএমএল এলিমেন্টের রঙ নির্ধারণ করা হয়েছে।`,
                        ,
                          
                        ],
                        input:[
                            `উদাহরণ`,
                        `h1 {`,
                            `color: blue;`,
                         `  }`,
                        
                       ` p {`,
                           `color: red;`,
                          `}`
                        ]
            },
            {
                text:[
                    `লিংকের রঙ নির্ধারণ`,
                    `color প্রপার্টি ব্যবহার করে এইচটিএমএল লিংক ট্যাগের মধ্যস্থিত লেখার রঙ নির্ধারণ করা যায়।
                    `,
                    `নিচে একটি উদাহরণ দেখুন, যেখানে color প্রপার্টি ব্যবহার করে এইচটিএমএল অ্যাংকর বা a ট্যাগের রঙ নির্ধারণ করা হয়েছে। এবং a:hover প্রপার্টি ব্যবহার করা হয়েছে, এর ফলে অ্যাংকর বা a ট্যাগের মধ্যস্থিত লেখার ওপর মাউস পয়েন্টার রাখলে লেখার রঙ পরিবর্তন হবে।`,
                    `নিচে একটি উদাহরণ দেখুন।`,],
                    input:[
                        `উদাহরণ`,
                    `a {`,
                        `color: blue;`,
                     `  }`,
                    
                   ` a:hover {`,
                       `color: red;`,
                      `}`
                    ]
            },
            {
                head:'রঙের ব্যবহার পদ্ধতি',
                text:[`সিএসএস এর মাধ্যমে ওয়েব পেজে রঙ ব্যবহার করা যায়। সিএসএস ব্যবহার করে ওয়েব পেজে রঙ নির্ধারণ করার পদ্ধতিগুলো হল নিম্মরুপ -`,
                `রঙের নাম লিখে,`,
                `RGB পদ্ধতি,`,
                `HEX পদ্ধতি,`,
                `HSL পদ্ধতি,`,
                `RGBA পদ্ধতি ও`,
                `HSLA পদ্ধতি।`
            
              

        ]
            },
            {
                head:'রঙের নাম লিখে,',
                text:[`HTML এ সরাসরি রঙের নাম লিখে রঙ নির্ধারণ করা যায়। নিচে এই রঙের নাম গুলো দেখুন।`,
                `Tomato,Orange,DodgerBlue,MediumSeaGreen,
                Gray,SlateBlue,Violet,LightGray`
                
                
        ]
            },
            {
                head:'RGB পদ্ধতি',
                text:[`HTML এ রঙ প্রদর্শনের একটি জনপ্রিয় পদ্ধতি হল আরজিবি পদ্ধতি বা rgb format. এই পদ্ধতিতে সর্বনিম্ন মান হল ০ এবং সর্বোচ্চ মান হল ২৫৫ অর্থাৎ ০ থেকে ২৫৫ পর্যন্ত মোট ২৫৬ টি ভিন্ন ভিন্ন মানের কম্বিনেশন বা মিশ্রণে ওয়েব পেজে রঙ প্রদর্শন করা হয়।`,
                `rgb ভ্যালু লেখার জন্য প্রথমে rgb লেখা হয় এবং তারপর প্রথম বন্ধনী ( 1st Breakt ) এর ভেতরে ৩ টি rgb সংখ্যা লেখা হয়। প্রথম rgb সংখ্যাটি নির্দিষ্ট করে লাল রং, দ্বিতীয় rgb সংখ্যাটি নির্দিষ্ট করে সবুজ রং এবং তৃতীয় rgb সংখ্যাটি নির্দিষ্ট করে নীল রং। প্রতিটি rgb সংখ্যা আলাদা করার জন্য কমা ( , ) ব্যবহার করা হয়। কোডটি দেখতে নীচের মত হবে -`,
                `যেমন লাল রং এর জন্য rgb কোড হবে rgb(255,0,0), সবুজ রং এর জন্য কোড হবে rgb(0,255,0) আবার নীল রং এর জন্য হবে rgb(0,0,255). নীচে RGB এর বিভিন্ন মানের মিশ্রন করে পরীক্ষা করে দেখুন।`
                
                
        ]
            },
            {
                head:'HEX পদ্ধতি',
                text:[`হেক্সাডেসিম্যাল সংখ্যাগুলো হল 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E এবং F. এই মোট ১৬ টি অক্ষর নিয়েই হেক্সাডেসিম্যাল পদ্ধতি। হেক্সাডেসিম্যাল পদ্ধতিতে সর্বনিম্ন মান হল ০ এবং সর্বোচ্চমান হল F. হেক্সাডেসিম্যাল পদ্ধতিতে সর্বনিম্ন মান ০০ যা RGB পদ্ধতিতে ০ এবং সর্বোচ্চমান মান FF যা RGB পদ্ধতিতে ২৫৫ হয়।`,
                `হেক্সাডেসিম্যাল ভ্যালু শুরু হয় প্রথমে একটি হ্যাস " # " চিহ্ন দিয়ে এবং তারপর ৩ জোড়া অর্থাৎ ৬ টি হেক্সাডেসিম্যাল সংখ্যা লেখা হয়। প্রথম হেক্সাডেসিম্যাল সংখ্যা জোড়া নির্দিষ্ট করে লাল রং, দ্বিতীয় হেক্সাডেসিম্যাল সংখ্যা জোড়া নির্দিষ্ট করে সবুজ রং এবং তৃতীয় হেক্সাডেসিম্যাল সংখ্যা জোড়া নির্দিষ্ট করে নীল রং। কোডটি দেখতে নীচের মত হবে -`,
                `অর্থাৎ ফরম্যাটটি হল #RRGGBB
                যেমন লাল রং এর জন্য হেক্সাডেসিম্যাল কোড হবে #ff0000, সবুজ রং এর জন্য কোড হবে #00ff00 আবার নীল রং এর জন্য হবে #0000ff. নীচে একটি টেবিলে কয়েকটি রং এর RGB এবং হেক্সাডেসিম্যাল কোড দেয়া হল -`
                
                
        ]
            },
            {
                head:'HSL পদ্ধতি',
                text:[`HTML এ রঙ বা hue, পরিপৃক্তি বা saturation এবং লঘিমা বা lightness উল্লেখ করে কোন এলিমেন্টের রঙ নির্দিষ্ট করে দেয়া যায়। এই পদ্ধতি HSL নামে পরিচিত। এর জন্য নিচের ফরম্যাটটি অনুসরণ করতে হবে -`,
                `hsl(hue, saturation, lightness)`,
                `নিচে এগুলোর বর্ণনা দেখুন -`,
                `রঙ বা hue হল color wheel এ অবস্থিত ০ থেকে ৩৬০ ডিগ্রির মধ্যবর্তী কোন মান যেখানে ০ লাল রঙ, ১২০ সবুজ রঙ এবং ২৪০ নীল রঙ প্রকাশ করে।`,
                `পরিপৃক্তি বা saturation হল একটি শতকরায় প্রকাশিত মান যেখানে ০% অর্থ ধূসর বা gray এবং ১০০% মান পূর্ণ রঙ নির্দিষ্ট করে। Saturation কে কোন রঙের তীব্রতা বা intensity হিসাবেও বর্ণনা করা যেতে পারে। এখানে ১০০% মানের জন্য নিখাদ রঙটি প্রকাশ পাবে, তাতে ধূসর রঙের কোন আঁচ থাকবে না। ৫০% মানের জন্য ৫০% মানের জন্য তাতে ধূসর রঙের আঁচ থাকবে, কিন্তু মুল রঙের ৫০% দেখা যাবে। ০% মানের জন্য সম্পূর্ণরূপে ধূসর রঙ দেখা যাবে, তখন আর কোন রঙ দেখা যাবে না।`,
                `এবং লঘিমা বা lightness ও অনুরূপ একটি শতকরায় প্রকাশিত মান। এক কথায় lightness হল light বা আলোর পরিমান, যেখানে ০% মানের জন্য আলোর অনুপস্থিতি অর্থাৎ অন্ধকার বা কালো, ৫০% মানের জন্য সাদা ও কালোর মধ্যবর্তী রঙ এবং ১০০% মানের জন্য পূর্ণ আলো অর্থাৎ সাদা নির্ধারিত হয়।`,
                
                
                
        ]
            },
            {
                head:'RGBA পদ্ধতি',
                text:[`RGBA পদ্ধতি হল RGB পদ্ধতিরই একটি বর্ধিত রুপ যেখানে একটি আলফা চ্যানেল বা alpha channel যুক্ত করা হয়েছে যা কোন রঙের স্বচ্ছতা নির্ধারণ করে।
                RGBA পদ্ধতির ফরম্যাটটি হল নিম্নরূপ -`,
                `rgba(red, green, blue, alpha)`,
                `ওপরের সিনট্যাক্সে প্রথম তিনটি মান RGB মান বা value অর্থাৎ red, green এবং blue রঙের পরিমান নির্ধারণ করে আর চতুর্থ মানটি হল আলফা মান যা রঙের স্বচ্ছতা বা Opacity নির্ধারণ করে।`,
                `এখানে আলফা প্যারামিটারটি হল ০.০ (সম্পূর্ণ স্বচ্ছ) থেকে ১.০ (স্বচ্ছ নয়) এর মধ্যবর্তী কোন মান যা কোন একটি রঙের স্বচ্ছতা নির্ধারণ করে।`
                
                
        ]
            },
            {
                head:'HSLA পদ্ধতি',
                text:[`HSLA পদ্ধতি হল HSL পদ্ধতিরই একটি বর্ধিত রুপ যেখানে একটি আলফা চ্যানেল বা alpha channel যুক্ত করা হয়েছে যা কোন একটি রঙের স্বচ্ছতা নির্ধারণ করে।
                HSLA পদ্ধতির ফরম্যাটটি হল নিম্নরূপ -`,
                `hsla(hue, saturation, lightness, alpha)`,
                `এখানে আলফা প্যারামিটারটি হল ০.০ (সম্পূর্ণ স্বচ্ছ) থেকে ১.০ (স্বচ্ছ নয়) এর মধ্যবর্তী কোন মান যা কোন একটি রঙের স্বচ্ছতা নির্ধারণ করে।`
                
                
        ]
            }
            
            
           
        ]
    },
    {
        id:10,
        title:'সিএসএস ব্যাকগ্রাউন্ড - CSS Background',
        category:' ব্যাকগ্রাউন্ড',
        desc:[
            'কোন এলিমেন্টের জন্য ব্যাকগ্রাউন্ড এর স্টাইল খুব গুরুত্বপূর্ণ। ওয়েব পেজের ব্যাকগ্রাউন্ডে বিভিন্ন স্টাইল যুক্ত করতে সিএসএস এর ব্যাকগ্রাউন্ড প্রপার্টি গুলো ব্যবহার করা হয়।',
            
        ],
        titleTwo: [
            {
                head:'ব্যাকগ্রাউন্ড প্রপার্টি',
                            text:[`সিএসএস এর ব্যাকগ্রাউন্ড প্রপার্টি গুলো নিচে দেখুন।`,
                       
                        ],
                        input:[
                            `background-color`,
                            `background-image`,
                            `background-repeat`,
                            `background-attachment`,
                            `background-position`
                        ]
            },
            {
                head:'background-color',
                text:[`কোন এলিমেন্টের ব্যাকগ্রাউন্ডের রং বা color নির্ধারণ করতে সিএসএস ব্যাকগ্রাউন্ড কালার (background-color) প্রপার্টি ব্যবহার করা হয়।`,
                `নিচে একটি উদাহরণ দেখুন, যেখানে কোন এইচটিএমএল ডকুমেন্টের body তে ব্যাকগ্রাউন্ড কালার নির্ধারণ করা হয়েছে।`,
               
            
              

        ],input:[
            `উদাহরণ`,
            `body {`,
                 `background-color: body;`,
                ` }`,
        ]
            },
            {
                text:[
                    `বিভিন্ন পদ্ধতিতে কালার উল্লেখ করা যায়। তার মাঝে উল্লেখযোগ্য পদ্ধতিগুলো হল -`,
                    `রঙের নাম ব্যবহার করে, যেমন- red, blue,`,
                    `RGB মান ব্যবহার করে, যেমন- rgb(55,00,00), (00,00,55),`,
                    `হেক্সাডেসিম্যাল পদ্ধতি ব্যবহার করে, যেমন- #550000, #000055,`,
                    `Transparency বা স্বচ্ছতা পদ্ধতি ও`,
                    `RGBA পদ্ধতি।`]
                   
            },
            {
                head:'কোন এলিমেন্টে background-color ব্যবহার',
                text:[`অন্য যে কোন এইচটিএমএল এলিমেন্টে background-color প্রপার্টি ব্যবহার করা যায়। নিচে একটি উদাহরণ দেখুন, যেখানে h1, h2, p এলিমেন্টে background-color প্রপার্টি ব্যবহার করা করা হয়েছে।`,
                
                
                
        ],
        input:[
            `উদাহরণ`,
                `h1 {`,
                  ` background-color: red;`,
                `   }`,
                
              `  h2 {`,
                  ` background-color: blue;`,
                  ` }`,
                
               ` p {`,
                   `background-color: green;`,
                   `}`
        ]
            },
            {
                head:'Opacity প্রপার্টি',
                text:[`Opacity প্রপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্টের পৃষ্ঠদেশে বা background এ স্বচ্ছতা তৈরি করা যায়। এই প্রপার্টির মান 0.0 থেকে 1.0 পর্যন্ত নির্ধারণ করা যায়, এক্ষেত্রে সর্বচ্ছো মানের জন্য সর্বনিম্ন স্বচ্ছতা বা Transparency হয়।`,
                `নিচে একটি উদাহরণ দেখুন।`,
                
                
                
        ],
        input:[
            `উদাহরণ`,
               ` div {`,
                  `opacity: 0.4;`,
                `}`
        ]
            },
            {
                head:'RGBA ব্যবহার করে ব্যাকগ্রাউন্ডে স্বচ্ছতা তৈরি',
                text:[`RGBA পদ্ধতি ব্যবহার করেও কোন এইচটিএমএল এলিমেন্টের পৃষ্ঠদেশে বা background এ স্বচ্ছতা তৈরি করা যায়।`,
                `RGBA পদ্ধতির ফরম্যাটটি হল নিম্নরূপ -`,
                `rgba(red, green, blue, alpha)`,
                `এখানে আলফা প্যারামিটারটি হল ০.০ (সম্পূর্ণ স্বচ্ছ) থেকে ১.০ (স্বচ্ছ নয়) এর মধ্যবর্তী কোন মান যা কোন একটি রঙের স্বচ্ছতা নির্ধারণ করে।

                নিচে একটি উদাহরণ দেখুন।`,
                
                
                
        ],
        input:[
            `উদাহরণ`,
              `  div {`,
                   ` background: rgba(11,11, 180, 0.4);`,
                    `}`
        ]
            },
            {
                head:'background-image',
                text:[`কোন এইচটিএমএল এলিমেন্টের পৃষ্ঠদেশে বা background এ কোন ছবি যুক্ত করতে সিএসএস এর background-image প্রপার্টি ব্যবহার করা হয়।`,
                
                
                
                
                
        ],
        input:[
            `উদাহরণ`,
                `body {`,
                   ` background-image: url("background.png");`,
                    `}`,
        ]
            },
            {
                text:[`সিএসএস এ ব্যাবহৃত জনপ্রিয় image format গুলো হল -`,
                `jpg`,
                `png`,
                `gif`,]
            },
            {
                head:'background-repeat',
                text:[`background-image প্রপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্টের পৃষ্ঠদেশে কোন ছবি যুক্ত করলে তা বারবার প্রদর্শিত হয়। এই ছবিটির প্রদর্শন সংখ্যা নিয়ন্ত্রন করার জন্য background-repeat প্রপার্টি ব্যবহার করা হয়। অর্থাৎ ছবিটি কোন দিকে কিভাবে প্রদর্শিত হবে তা নির্ধারণ করা যায়।`,
                `background-repeat প্রপার্টির জন্য ৪টি মান নির্ধারণ করা যায়। নিচে এগুলো দেখুন -`,
                `repeat - এলিমেন্টের পৃষ্ঠদেশে সম্পূর্ণ উলম্ব এবং আনুভুমিক দিক জুরে ছবি প্রদর্শিত হবে।`,
                `repeat-x - এলিমেন্টের পৃষ্ঠদেশে সম্পূর্ণ আনুভুমিক দিক জুরে ছবি প্রদর্শিত হবে।`,
                `repeat-y - এলিমেন্টের পৃষ্ঠদেশে সম্পূর্ণ উলম্ব দিক জুরে ছবি প্রদর্শিত হবে।`,
                `no-repeat - এলিমেন্টের পৃষ্ঠদেশে মাত্র একবার ছবি প্রদর্শিত হবে।`,
                `background-repeat প্রপার্টির একটি উদাহরণ নিচে দেখুন।`,
                
                
                
        ],input:[
            `body {`,
                `background-image: url("background.png");`,
               ` background-repeat: repeat-x;`,
                `}`
        ]
            },
            {
                head:'background-attachment',
                text:[`ওয়েব পেজটি scroll করে ওপর-নিচ করার সাথে পৃষ্টদেশ বা background এ নির্ধারিত ছবিটিও নড়বে কি না, তা নির্ধারণ করা হয় সিএসএস এর background-attachment প্রপার্টি ব্যবহার করে।`,
                `background-attachment প্রপার্টির ২ টি মান নির্ধারণ করা যায়। নিচে এগুলো দেখুন।`,
                `fixed - এই মানের জন্য ছবিটি পৃষ্টদেশে স্থির থাকবে,`,
                `scroll - এই মানের জন্য ওয়েব পেজ scroll করার সাথে ছবিটিও পৃষ্টদেশে scroll করবে।`
                
                
        ]
            },
            {
                head:'background-position',
                text:[`যদি পৃষ্টদেশের নির্দিষ্ট কোন অংশে ছবি প্রদর্শন করার প্রয়োজন হয় তবে background-position প্রপার্টি ব্যবহার করে তা করা যায়।`,
                `ছবিটি কে পৃষ্টদেশ বা background এর কোন নির্দিষ্ট অংশে প্রদর্শন করার জন্য নীচে একটি উদাহরণ দেখুন -`,
                
                
                
        ],input:[
            `উদাহরণ`,
               ` body{`,
                  ` background-image:url('background.jpg');`,
                   `background-repeat:no-repeat;`,
                   `background-position:right top;`,
                   `}`
        ]
            },
            {
                head:'শর্ট-হ্যান্ড প্রপার্টি',
                text:[`কোড সংক্ষিপ্ত করে লেখার জন্য, সবগুলো ব্যাকগ্রাউন্ড প্রপার্টি একটি মাত্র সিএসএস ব্যাকগ্রাউন্ড প্রপার্টির মাধ্যমে প্রকাশ করা যায়। অর্থাৎ background-color, background-image, background-repeat, background-attachment এবং background-position এর জন্য আলাদা আলাদা ভাবে ব্যাকগ্রাউন্ড প্রপার্টি নির্দিষ্ট না করে একবার মাত্র ব্যাকগ্রাউন্ড প্রপার্টি ব্যবহার করেই সবগুলো ব্যাকগ্রাউন্ড প্রপার্টি নির্দিষ্ট করে দেয়া যায়। একে বলে শর্টহ্যান্ড প্রপার্টি।`,
                `ব্যাকগ্রাউন্ডের সকল প্রপার্টিগুলোর শর্টহ্যান্ড প্রপার্টি হল background.`,
                `নীচে ব্যাকগ্রাউন্ড শর্টহ্যান্ড প্রপার্টি লেখার নিয়ম দেয়া হল -`,
               
                    
                
                
        ],input:[
            `উদাহরণ`,
           ` body {`,
                ` background:#ffffff url('background.jpg') no-repeat fixed right top;`,
                ` }`,
        ]
            },
            {
                text:[ `শর্টহ্যান্ড প্রপার্টি ব্যবহার করার জন্য একটি নির্দিষ্ট সারি বা ক্রম অনুসরন করতে হবে। তা হল শর্টহ্যান্ড প্রপার্টিতে প্রথমে color তারপর background-image তারপর repeat তারপর attachment এবং সর্বশেষে position উল্লেখ করতে হবে। তবে এই ক্রম থেকে কোন প্রপার্টি বাদ গেলেও শর্টহ্যান্ড প্রপার্টি সঠিক ভাবে কাজ করবে।`]
            }
            
           
        ]
    },
    {
        id:11,
        title:'সিএসএস লেখার স্টাইল - CSS Text Style',
        category:' টেক্সট স্টাইল',
        desc:[
            'কোন ওয়েব পেজে সবথেকে বেশী যে কন্টেন্ট ব্যবহার করা হয় তা হল লেখা বা text, তাই টেক্সট স্টাইলিং এর দিকে সবথেকে বেশী খেয়াল রাখা হয়। সিএসএস ব্যবহার করে যে কোন টেক্সট এলিমেন্ট যেমন - প্যারাগ্রাফ ট্যাগ বা হেডিং ট্যাগ সম্পূর্ণরূপে স্টাইল করা যায়।',
            
        ],
        titleTwo: [
            {
                head:'টেক্সট প্রপার্টি',
                            text:[`কোন লেখাকে সাজানো বা স্টাইল করার জন্য সিএসএস এর বেস কিছু প্রোপার্টি আছে, সেগুলো হল color, text-color, background-color, text-align, text-decoration, direction, unicode-bidi, text-transform, vertical-align, letter-spacing, line-height, word-spacing, white-space, text-indent ও text-shadow.`
                       
                        ]
            },
            {
                head:'color এবং text-color প্রোপার্টি',
                text:[`কোন লেখার রং নির্ধারণ করার জন্য সিএসএস এর color এবং text-color প্রোপার্টি ব্যবহার করা হয়।`,
                `চে একটি উদাহরন দেখুন, যেখানে সিএসএস color প্রোপার্টি ব্যবহার করে একটি লেখার রং নির্ধারণ করা হয়েছে।`,
        ],
        input:[
            `উদাহরণ`,
               ` p {`,
                  `color: forestgreen;`,
                  `}`
        ]
            },
            {
                head:'background-color প্রোপার্টি',
                text:[`সিএসএস এর background-color প্রোপার্টি ব্যবহার করে কোন এইচটিএমএল টেক্সট এলিমেন্টের পৃষ্ঠদেশে বা background এ রং সংযুক্ত করা যায়।`,
                `নিছে একটি উদাহরন দেখুন, যেখানে background-color প্রোপার্টি ব্যবহার করা হয়েছে।`,
               
                
                
        ],input:[
            `উদাহরণ`,
          `  h1 {`,
              ` background-color: teal;`,
              ` }`,
           ` p  {`,
              ` background-color: forestgreen;`,
               `}`
        ]
            },
            {
                head:'text-align প্রোপার্টি',
                text:[`সিএসএস এর text-align প্রোপার্টি ব্যবহার করে কোন লেখার অবস্থান নির্ধারণ করা যায়। এর যে সকল মান নির্ধারণ করা যায়, সেগুলো হল - left, right, center এবং justify.`,
                `নিচে একটি উদাহরন দেখুন।`,
                
                 
                
                
        ],input:[
            `উদাহরণ`,
              `  h1{`,
                  `text-align: left;`,
                  `}`,
                
                `h2{`,
                  `text-align: right;`,
                 ` }`,
                
               ` h3{`,
                  `text-align: center;`,
                  `}`
        ]
            },
            {
                text:[ `সিএসএস এর text-align প্রোপার্টির মান justify নির্ধারণ করা হলে, লেখা গুলো ওয়েব পেজে এমন ভাবে প্রদর্শিত হয়, যেন লেখা গুলো দুই পাসে প্রসারিত করা হয় যাতে প্রতিটি লাইনের সমান প্রস্থ থাকে এবং বাম এবং ডান প্রান্তটি সোজা হয়। ম্যাগাজিন এবং সংবাদপত্রগুলিতে এরকম স্টাইল এর লেখা হয়।`]
            },
            {
                head:'text-decoration প্রোপার্টি',
                text:[`সিএসএস এর text-decoration প্রোপার্টি ব্যবহার করে কোন লেখার তে একটি আনুভূমিক রেখা যুক্ত করা যায় বা পূর্ব-নির্ধারিত বা default ভাবে যুক্ত আনুভূমিক রেখা বাদ দেয়া যায়। এই প্রোপার্টির সম্ভাব্য মান হতে পারে - overline, middle এবং underline.`,
                `rনিচে একটি উদাহরন দেখুন।`,
                
               
                
                
        ],input:[
            `উদাহরণ`,
                `h1 {`,
                  ` text-decoration: overline;`,
                  ` }`,
                   
              ` h2 {` ,
                  ` text-decoration: middle;`,
                   `}`,
                   
               ` h3 {`,
                   `text-decoration: underline;`,
                   `}`
        ]
            },
            {
                text:[
                    `যখন একটি লিংক তইরি করা হয়, ব্রাউজার পূর্ব-নির্ধারিত ভাবেই <a> ... </a> ট্যাগের মধ্যস্থিত লেখার নিচে একটি আনুভূমিক রেখা প্রদর্শন করে। এই রেখাকে বাদ দেবার জন্য নিচে একটি উদাহরন দেখুন, যেখানে text-decoration প্রোপার্টির মান none ব্যবহার করা হয়েছে।`
                ],
                input:[
                    `উদাহরণ`,
                    `a {`,
                       ` text-decoration: none;`,
                        `}`
                ]
            },
            {
                head:'direction ও unicode-bidi প্রোপার্টি',
                text:[`সিএসএস এর direction ও unicode-bidi প্রোপার্টি ব্যবহার করতে কোন লেখার দিক পরিবরতন কর যায়।`,
                `নিচে একটি উদাহরন দেখুন।`,
    
        ],
        input:[
            `উদাহরণ`,
           ` h2 {`,
               `direction: rtl;`,
              ` unicode-bidi: bidi-override;`,
               `}`
        ]
            },
            {
                head:'text-transform প্রোপার্টি',
                text:[`সিএসএস এর text-transform প্রোপার্টি ব্যবহার করে লেখাটি ছোট হাতের অক্ষর না বড় হাতের অক্ষরএ হবে তা নির্ধারণ করা যায়। text-transform প্রোপার্টির মান হতে পারে - capitalize, uppercase এবং lowercase.`,
                `নিচে একটি উদাহরন দেখুন।`,
                
                
        ],
        input:[
            `উদাহরণ`,
               ` h1.cap{`,
                 ` text-transform: capitalize;`,  
                   ` }`,
                
               ` h1.upp{`,
                    `text-transform: uppercase;`,
                    `}`,
                
             `   h1.low{`,
                   ` text-transform: lowercase;`,
                    `}`
        ]
            },
            {
                head:'vertical-align প্রোপার্টি',
                text:[`কোন এলিমেন্ট এর vertical বা উলম্ব অবস্থান নির্ধারণ করার জন্য সিএসএস এর vertical-align প্রোপার্টি ব্যবহার করা হয়। অর্থাৎ সিএসএস এর এই প্রোপার্টি ব্যবহার করে কোন ছবি, লেখার উপরে কথায় অর্থাৎ লেখাটি কোন ছবির পিছনে কোথায় প্রদর্শিত হবে তা নির্ধারণ করে।`,
                `নিচে একটি উদাহরন দেখুন।`,
               
        
                
                
        ],input:[
            `উদাহরণ`,
          `  img.h1{`,
              `vertical-align: rtl;`,
              `}`
        ]
            },
            {
                head:'letter-spacing প্রোপার্টি',
                text:[`সিএসএস এর letter-spacing প্রোপার্টি ব্যবহার করে কোন লেখতে শব্দের বর্ণ বা letter গুলোর মাঝের ফাঁকা স্থান নির্ধারণ করা যায়। এর মান px বা em ব্যবহার করেও নির্ধারণ করা যায়।`,
                `নিচে একটি উদাহরন দেখুন।`,
                
                
                
        ],input:[
            `উদাহরণ`,
                `p {`,
                  `letter-spacing: 3px;`,
                  `}`
        ]
            },
            {
                head:'line-height প্রোপার্টি',
                text:[`সিএসএস এর line-height প্রোপার্টি ব্যবহার করে লেখাতে লাইন গুলোর মধ্যবর্তী ফাঁকা স্থান (ওপর-নিচে) নির্ধারণ করা যায়।`,
                `নিচে একটি উদাহরন দেখুন।`,
                
                
                
        ],input:[
            `উদাহরণ`,
                `p {`,
                 `line-height: 1.2;` ,
                  `}`
        ]
            }
            
            
           
        ]
    },
    {
        id:12,
        title:'সিএসএস ফন্ট - CSS Font',
        category:' ফন্ট স্টাইল',
        desc:[
            'কোন লেখা বা text এর স্টাইল, সাইজ ইত্যাদি নির্ধারণ বা পরিবর্তন করার জন্য সিএসএস এর font প্রপার্টি ব্যবহার করা হয়।',
            
        ],
        titleTwo: [
            {
                head:'ফন্ট ফ্যামিলি',
                            text:[`সিএসএস এ ২ ধরনের font family আছে। এগুলো হল -`,
                            `generic family - অনেকটা একই রকম দেখতে কতগুলো ফন্ট ফ্যামিলি (যেমন- Serif এবং Monospace) এর group,`,
                            `font family - একটি নির্দিষ্ট ফন্ট ফ্যামিলি যেমন - Times New Roman, "Arial ইত্যাদি।`
                       
                        ]
            },
            {
                head:'font-family প্রোপার্টি',
                text:[`কোন লেখার জন্য ফন্ট ফ্যামিলি নির্ধারণ করা হয় সিএসএস এর font-family প্রোপার্টি ব্যবহার করে। font-family প্রপার্টিতে একই রকম দেখতে বা অনেকটা মিল আছে, এমন কয়েকটি ফন্টের নাম ব্যবহার করা উচিৎ যাতে ব্রাউজার কোন কারনে যদি নির্দিষ্ট ফন্ট খুঁজে না পায় তবে যেন অনেকটা ঐ রকম দেখতে অন্য কোন ফন্ট প্রদর্শন করতে পারে।`,
                `অর্থাৎ নির্দিষ্ট ফন্টের নাম প্রথমে লিখতে হবে এবং তারপরে একই রকম দেখতে বা অনেকটা মিল আছে এমন অন্য ফন্টগুলোর নাম লিখতে হবে।`
            
              

        ]
            },
            {
                head:'font style প্রোপার্টি',
                text:[`সিএসএস এর font style প্রোপার্টি ব্যবহার করে কোন লেখাকে একটু বাঁকা অর্থাৎ italic স্টাইল করা হয়। font style এর জন্য যে সকল মান নির্ধারণ করা যায়, সেগুলো হল - normal, italic এবং oblique.`,
                `oblique স্টাইলটি মুলত italic স্টাইল থেকে একটু কম বাঁকা।`,
                `নিচে একটি উদাহরন দেখুন, যেখানে একটি লেখার জন্য font style প্রোপার্টি ব্যবহার করা হয়েছে।`,
                
                
                
        ],input:[
            `উদাহরণ`,
               ` p {`,
                 ` font-style: italic;`,
                  `}`
        ]
            },
            {
                head:'font-weight প্রোপার্টি',
                text:[`সিএসএস এর font-weight প্রোপার্টি ব্যবহার করে কোন লেখা বা text গভীরতা বা weight নির্ধারণ করা যায়।`,
                `নিচে একটি উদাহরন দেখুন, যেখানে একটি লেখার জন্য font-weight প্রোপার্টি ব্যবহার করা হয়েছে।`,
     
                
        ],input:[
            `উদাহরণ`,
               ` p {`,
                 ` font-weight: bold;`,
                  `}`
        ]
            },
            {
                head:'font-variant প্রোপার্টি',
                text:[`সিএসএস এর font-variant প্রোপার্টি ব্যবহার করে কোন লেখার সকল শব্দ বা ward গুলোর প্রথম বর্ণ বা letter কে একটু বড় করে এবং বড় হাতের অক্ষরে প্রদর্শিত করা যায়।`,
                `নিচে একটি উদাহরন দেখুন, যেখানে একটি লেখার জন্য font-variant প্রোপার্টি ব্যবহার করা হয়েছে।`,
               
                
                
        ],input:[
            `উদাহরণ`,
           ` h1 {`,
               `font-variant: small-caps;`,
               `}`
        ]
            },
            {
                head:'font-size প্রোপার্টি',
                text:[`সিএসএস এর font-size প্রোপার্টি ব্যবহার করে লেখা বা text এর আকার বা size নির্ধারণ করা যায়।`,
                `ওয়েব পেজের জন্য সঠিক ভাবে ফন্ট নির্বাচন করা প্রয়োজন। হেডিং এর জন্য প্যারাগ্রাফের মত font-size নির্ধারণ করা বা প্যারাগ্রাফের জন্য হেডিং এর মত font-size নির্ধারণ করা কোন ভাবেই ঠিক নয়।`,
                `ফন্ট সাইজের মান বা value ২ প্রকার হতে পারে। যথা -`,
                `Absolute size - এ পদ্ধতিতে লেখার জন্য একটি নির্দিষ্ট আকার বা size নির্ধারণ করে দেয়া হয়। এ পদ্ধতিতে ব্যবহারকারী কোন ব্রাউজারই লেখার আকার পরিবর্তন করতে পারে না।`,
                `Relative size - এই পদ্ধতিতে লেখার আকার এলিমেন্টের ওপর পরিবর্তনশীল হয়। এতে ব্যবহারকারী চাইলে লেখার আকার পরিবর্তন করতে পারে।`,
                `যদি কোন লেখার আকার নির্দিষ্ট করে দেয়া না হয় তবে, পারাগ্রাফ এর ক্ষেত্রে পূর্ব-নির্ধারিত বা default মান হল16px অর্থাৎ ব্রাউজার লেখা গুলোকে 16px এর আকারে প্রদর্শন করবে। এখানে মনে রাখুন 16px=1.0em`
                
                
                
                
        ]
            },
            {
                head:'font-size এবং px',
                text:[`পিক্সেল বা px এর মাধ্যমে লেখা বা text এর আকার বা size নির্দিষ্ট করার ফলে টেক্সট সাইজের ওপর পূর্ণ নিয়ন্ত্রণ পাওয়া যায়।`,
                `পিক্সেল বা px এর মাধ্যমে লেখা বা text এর আকার বা size নির্দিষ্ট করার একটি উদাহরণ নীচে দেখুন -`,
               
                
        ],input:[
            `উদাহরণ`,
            `h1 {`,
              ` font-size:30px;`,
             ` }`, 
               
               ` p {`, 
              ` font-size:17px;`,
               `}`
        ]
            },
            {
                head:'font-size এবং em',
                text:[`ইন্টারনেট এক্সপ্লোরার এ resizing সমস্যা সমাধানের জন্য অনেক ওয়েব ডেভোলপার pixel এর পরিবর্তে em পদ্ধতি ব্যবহার করে। em size পদ্ধতি W3C দ্বারা সমর্থিত।`,
                `1em সমান হল চলতি ফন্টের সাইজ। ব্রাউজার এর স্বয়ংক্রিয় বা default ফন্ট সাইজ হল 16px, তাই 1em এর স্বয়ংক্রিয় বা default সাইজ হল 16px.`,
                `pixel থেকে em এ পরিবর্তনের জন্য নীচের সূত্রটি ব্যবহার করা যায় -
                pixel/16=em`,
                `নীচে কয়েকটি উদাহরণ দেখুন -`,
                
                 
        
                
                
        ],input:[
            `উদাহরণ`,
               ` h1 {`,
                 ` font-size: 2.187em; /* 35px/16=2.187em */`,
                   `}`,
                
              `  p {`,
                 ` font-size: 1.0em; /* 16px/16=1.0em */`,
                  `}`,
        ]
            },
            {
                text:[ `ওপরের উদাহরণে em এ দেয়া font-size প্রোপার্টির মান, পূর্বের উদাহরণে pixel ব্যবহার করে উল্লেখ করা ফন্ট সাইজ এর সমান। তবে যাইহোক em পদ্ধতি ব্যবহার করে সকল ব্রাউজারেই font-size প্রোপার্টি নির্দিষ্ট বা adjust করা যায়।`]
            },
            {
                head:'pixel এবং em এর মিলিত font size',
                text:[`সব ব্রাউজার ই সমান ভাবে প্রদর্শনের জন্য body এলিমেনটে শতকরা পদ্ধতিতে একটি পূর্ব-নির্ধারিত বা default ফন্ট সাইজ নির্ধারণ করে দেয়া হয়।`,
                
               
                
                
        ],input:[
            `উদাহরণ`,
              `  body {`,
                   `font-size:100%;`,
                  ` }`,
                   
              `  h1 {`,
                   `font-size:2.175em;`,
                   `}`,
                   
                `p {`,
                   `font-size:1.0em;`,
                  `}`
        ]
            },
            {
                text:[ `এখন এটি সমস্ত ব্রাউজারে একই আকারের টেক্সট প্রদর্শন করবে এবং টেক্সটকে সুন্দরভাবে zoom বা resize করা সম্ভব হবে।`]
            },
            {
                head:'শর্টহ্যান্ড প্রোপার্টি - font',
                text:[`সিএসএস এর শর্টহ্যান্ড প্রোপার্টি ব্যবহার করে অনেক গুলো সিএসএস প্রোপার্টি না লিখে কেবল মাত্র শর্টহ্যান্ড প্রোপার্টি ব্যবহার করে ঐ সকল প্রোপার্টির মান বা value নির্ধারণ করে দেয়া যায়। যেমন সিএসএস font শর্টহ্যান্ড প্রোপার্টি ব্যবহার করে নিচের প্রোপার্টি গুলোর মান নির্ধারণ করা যায়।`,
                `font-style, font-variant, font-weight, font-size/line-height এবং font-family.`,
               
                
                
        ],input:[
            `উদাহরণ`,
           ` h1 {`,
               `font: italic small-caps bold 22px/42px Times New Roman, Times, serif; `,
            `}`
        ]
            }
            
            
           
        ]
    },
    {
        id:13,
        title:'সিএসএস লিংক - CSS link',
        category:'সিএসএস লিংক',
        desc:[
            'সিএসএস লিংক প্রপার্টি গুলো ব্যবহার করে এইচটিএমএল লিংক কে বিভিন্ন ভাবে স্টাইল করা যায়।',
            
        ],
        titleTwo: [
            {
                head:'লিংক স্টাইলের জন্য প্রোপার্টি',
                            text:[`কিছু সিএসএস প্রপার্টি যেমন - background, font-family, color, border, border-shadows, text-shadow ইত্যাদি ব্যবহার করে লিংক স্টাইলিং করা যায়।`,
                            `কোন লিংক এর ৪টি অবস্থায় বা state এ বিভিন্ন স্টাইল করার জন্য সিএসএস এর আরও কিছু প্রোপার্টি ব্যবহার করা যায়, সেগুলো হল - a:link, a:visited, a:hover এবং a:active.`
                       
                        ]
            },
            {
                head:'a:link',
                text:[`কোন স্বাভাবিক বা normal লিংক যা ইতোপূর্বে visit করা হয় নি এমন অবস্থার স্টাইল নির্ধারণ করার জন্য a:link প্রপার্টি ব্যবহার করা হয়। সিএসএস এর বিভিন্ন স্টাইলিং প্রপার্টি যেমন - color, background-color, text-shadow ইত্যাদি এর সাথে ব্যবহার করা যায়।`,
                `নীচে a:link প্রপার্টি ব্যবহার করে একটি উদাহরন দেখুন -`,
                
        ],input:[
            `উদাহরণ`,
               ` a:link{`,
                  ` text-color: red;`,
                   `font-family: sarif`,
                  ` text-decoration: none;`,
                  ` text-size: 16px;`,
                  ` font-weight: bold;`,
                   `}`
        ]
            },
            {
                head:'a:visited',
                text:[`কোন লিংক যা ইতোপূর্বে visit করা হয়েছে এমন অবস্থার স্টাইল নির্ধারণ করার জন্য a:visited প্রপার্টি ব্যবহার করা হয়। সিএসএস এর বিভিন্ন স্টাইলিং প্রপার্টি যেমন - color, background-color, text-shadow ইত্যাদি এর সাথে ব্যবহার করা যায়।`,
               
                
                
        ],input:[
            `উদাহরণ`,
            ` a:visited{`,
               ` text-color: red;`,
                `font-family: sarif`,
               ` text-decoration: none;`,
               ` text-size: 16px;`,
               ` font-weight: bold;`,
                `}`
        ]
            },
            {
                head:'a:hover',
                text:[`কোন লিংক এর ওপর মাউস পয়েন্টার স্থাপন করলে কি রকম স্টাইল সৃষ্টি হবে তা নির্ধারণ করার জন্য a:hover প্রপার্টি ব্যবহার করা হয়। সিএসএস এর বিভিন্ন স্টাইলিং প্রপার্টি যেমন - color, background-color, text-shadow ইত্যাদি এর সাথে ব্যবহার করা যায়।`,
                `নীচে a:hover প্রপার্টি ব্যবহার করে একটি উদাহরন দেখুন -`,
                  
        ],
        input:[
            `উদাহরণ`,
            ` a:hover{`,
               ` text-color: red;`,
                `font-family: sarif`,
               ` text-decoration: none;`,
               ` text-size: 16px;`,
               ` font-weight: bold;`,
                `}`
        ]
            },
            {
                head:'a:active',
                text:[`লিংকের ওপর মাউস পয়েন্টার স্থাপন করে ক্লিক করার সময় লিংকে কি রকম স্টাইল সৃষ্টি হবে তা নির্ধারণ করার জন্য a:active প্রপার্টি ব্যবহার করা হয়। সিএসএস এর বিভিন্ন স্টাইলিং প্রপার্টি যেমন - color, background-color, text-shadow ইত্যাদি এর সাথে ব্যবহার করা যায়।`,
                `নীচে a:active প্রপার্টি ব্যবহার করে একটি উদাহরন দেখুন -`,
                
                
                
        ],input:[
            `উদাহরণ`,
            ` a:active{`,
               ` text-color: red;`,
                `font-family: sarif`,
               ` text-decoration: none;`,
               ` text-size: 16px;`,
               ` font-weight: bold;`,
                `}`
        ]
            },
            {
                head:'class ব্যবহার',
                text:[`এইচটিএমএল লিংক এলিমেন্ট এর সাথে class সিলেক্টর ব্যবহার করে কোন লিংক এর স্টাইল করা যায়।`,
                `নিচে একটি উদাহরণ দেখুন, যেখানে class ব্যবহার করা হয়েছে।`,
                `ফন্ট সাইজের মান বা value ২ প্রকার হতে পারে। যথা -`,
                
                
                
                
                
        ]
        ,
        input:[
            `উদাহরণ`,
        ` <style>`,
       ` .home a{
        color: forestgreen;
        text-decoration: none;
        }`,
           
       ` .home a:hover{
           color: teal;
           text-decoration: underline;
           }`,
       ` <style>`,
        
        `<body>`,
           
          ` <a="url" class="home">websschool.com</a>`,
        
        `</body>`]
            },
            {
                head:'id ব্যবহার',
                text:[`এইচটিএমএল লিংক এলিমেন্ট এর সাথে id সিলেক্টর ব্যবহার করে কোন লিংক এর স্টাইল করা যায়।`,
                `নিচে একটি উদাহরণ দেখুন, যেখানে id ব্যবহার করা হয়েছে।`,
        ],
        input:[
            `উদাহরণ`,
        ` <style>`,
       ` #home a{
        color: forestgreen;
        text-decoration: none;
        }`,
           
       `#home a:hover{
        color: teal;
        text-decoration: underline;
        }`,
       ` <style>`,
        
        `<body>`,
           
          ` <a="url" id="home">websschool.com</a>`,
        
        `</body>`]
            },
            {
                head:'লিংক সহ Button তৈরি',
                text:[`সিএসএস এর কয়েকটি প্রোপার্টি ব্যবহার করে একটি লিংক সহ Button তৈরি করা যায়।`,
                `নিচে একটি উদাহরন দেখুন, যেখানে কিছু সিএসএস প্রোপার্টি ব্যবহার করে একটি button তৈরি করা হয়েছে।`
                
        ], input:[
            `উদাহরণ`,
        ` <style>`,
       ` a{
        background-color: #ff6666;,
        color: white;
        font-weight:900;
        border:1px solid #ff6666;
        padding:0.70em 2.1em;
        text-decoration: none;
        }`,
           
       `a:hover{`,
       ` background-color: #ff7777;`,
        `color: white;`,
       ` font-weight:900;`,
       ` padding:0.70em 2.1em;`,
       ` text-decoration: none;`,
       ` border:1px solid red;`,
       ` border-shadows:5px 5px 10px black;
        }`,
       ` <style>`,
        
        
           
          ` <a href="example.html">Simple Link</a>`,
        
        `</body>`]

            },
          
           
            
            
           
        ]
    },
    {
        id:14,
        title:'সিএসএস লিস্ট - CSS List',
        category:'সিএসএস লিস্ট',
        desc:[
            'সিএসএস লিস্ট প্রপার্টির ব্যবহার করে কোন ছবিকে লিস্ট আইটেম মার্কার হিসেবে ব্যবহার করা যায়,কোন অর্ডারড বা আনঅর্ডারড লিস্টের মার্কার ছিনহ পরিবর্তন করা যায়। আরও বেস কিছু স্টাইল এর কাজ সিএসএস লিস্ট প্রপার্টি গুলো ব্যবহার করে করা যায়।',
            
        ],
        titleTwo: [
            {
                head:'list-style-type প্রপার্টি',
                            text:[`ist-style-type প্রপার্টি ব্যবহার করে লিস্ট আইটেম মার্কার এর প্রকার অর্থাৎ লিস্ট আইটেম গুলো কি রকম দেখতে হবে তা নির্ধারণ করা যায়।`,
                            `আনঅর্ডারড লিস্টের জন্য list style type প্রপার্টির মান হতে circle, square, dices এবং none.`,
                            `অর্ডারড লিস্টের জন্য list style type প্রপার্টির মান হতে পারে upper-roman, lower-alpha, none ইত্যাদি।`
                       
                        ]
            },
            {
                head:'আনঅর্ডারড লিস্টে list style type ব্যবহার',
                text:[`নিচে সিএসএস list style type প্রোপার্টি ব্যবহার করে একটি উদাহরন দেখানো হল, যেখানে আনঅর্ডারড লিস্টের জন্য সিএসএস স্টাইল কোড লেখা হয়েছে।`,       

        ],
        input:[
            `উদাহরণ`,
            `ul {`,
               `list-style-type: square;`,
               `}
               `
        ]
            },
            {
                head:'আনঅর্ডারড লিস্টের সাথে class ব্যবহার',
                text:[`নিচে সিএসএস list style type প্রোপার্টি ব্যবহার করে একটি উদাহরন দেখানো হল, যেখানে আনঅর্ডারড লিস্টের সাথে class ব্যবহার করে সিএসএস স্টাইল কোড লেখা হয়েছে।`      
        ],
        input:[
            `উদাহরণ`,
            `ul.circle {`,
               ` list-style-type: circle;`,
               `}`,

             `ul.square {`,
             ` list-style-type: square;`,
             `}`,
             `ul.dices  {`,
             ` list-style-type: dices;`,
             `}`
        ]
            },
            {
                head:'আনঅর্ডারড লিস্টের সাথে id ব্যবহার',
                text:[`নিচে সিএসএস list style type প্রোপার্টি ব্যবহার করে একটি উদাহরন দেখানো হল, যেখানে আনঅর্ডারড লিস্টের সাথে id ব্যবহার করে সিএসএস স্টাইল কোড লেখা হয়েছে।`      
        ],
        input:[
            `উদাহরণ`,
            `ul#circle {`,
               ` list-style-type: circle;`,
               `}`,

             `ul#square {`,
             ` list-style-type: square;`,
             `}`,
             `ul#dices  {`,
             ` list-style-type: dices;`,
             `}`
        ]
            },
            {
                head:'অর্ডারড লিস্টে list-style-type ব্যবহার',
                text:[`নিচে সিএসএস list style type প্রোপার্টি ব্যবহার করে একটি উদাহরন দেখানো হল, যেখানে অর্ডারড লিস্টের জন্য সিএসএস স্টাইল কোড লেখা হয়েছে।`,        
        ],
        input:[
            `উদাহরণ`,
                `ol {`,
                        `list-style-type: upper-roman;`,
                    `}`
        ]
            },
            {
                head:'অর্ডারড লিস্টের সাথে class ব্যবহার',
                text:[`নিচে সিএসএস list style type প্রোপার্টি ব্যবহার করে একটি উদাহরন দেখানো হল, যেখানে অর্ডারড লিস্টের সাথে class ব্যবহার করে সিএসএস স্টাইল কোড লেখা হয়েছে।`,       
        ]
        ,
        input:[
            `উদাহরণ`,
        ` <style>`,
       ` ol.upper-roman {`,
       ` list-style-type: upper-roman;`,
       `}`,
        `ol.lower-greek {`,
        ` list-style-type: lower-greek;`,
        `}`,
           
       `ol.katakana-iroha {`,
       `list-style-type: katakana-iroha;`,
           `}`,
    ]
            },
            {
                head:'অর্ডারড লিস্টের সাথে id ব্যবহার',
                text:[`নিচে সিএসএস list style type প্রোপার্টি ব্যবহার করে একটি উদাহরন দেখানো হল, যেখানে অর্ডারড লিস্টের সাথে id ব্যবহার করে সিএসএস স্টাইল কোড লেখা হয়েছে।`,
        ],
        input:[
            `উদাহরণ`,
        ` <style>`,
       ` ol#upper-roman {`,
       ` list-style-type: upper-roman;`,
       `}`,
        `ol#lower-greek {`,
        ` list-style-type: lower-greek;`,
        `}`,
           
       `ol#katakana-iroha {`,
       `list-style-type: katakana-iroha;`,
           `}`,
    ]
            },
       
        ]
    },
    {
        id:15,
        title:'সিএসএস টেবিল - CSS Table',
        category:'সিএসএস টেবিল ',
        desc:[
            'সিএসএস এর টেবিল প্রপার্টি গুলো ব্যবহার করে এইচটিএমএল টেবিলে সম্পূর্ণ স্টাইলিং করা যায়। নিছে একটি টেবিল দেখুন।',
            
        ],
        titleTwo: [
            {
                head:'টেবিল প্রপার্টি',
                            text:[`এইচটিএমএল টেবিলে সিএসএস এর যে সব প্রপার্টি ব্যবহার করা যায় সেগুলো হল border, border-collapse, color, background-color, width, height, padding, text-align, vertical-align ইত্যাদি।`
                       
                        ]
            },
            {
                head:'border প্রোপার্টি',
                text:[`সিএসএস border প্রোপার্টি ব্যবহার করে এইচটিএমএল এর টেবিলে স্টাইল করা যায়। এর মাধ্যমে টেবিলে বর্ডার তৈরি করা যায়।`,
                `টেবিলে বর্ডার প্রপার্টি ব্যবহার করে নিচে একটি উদাহরণ দেখুন -`       

        ],
        input:[
            `উদাহরণ`,
            `table, th, td {`,
               ` border: 2px solid blue;`,
               `}
               `
        ],

       
            },
            {text:[
                `বর্ডার প্রপার্টির ব্যবহার সিএসএস বর্ডারের মতই, প্রথমে বর্ডারের width, তারপর বর্ডারের স্টাইল যেমন- solid, dotted ইত্যাদি এবং সর্বশেষে বর্ডারের রং বা color উল্লেখ করতে হয়।`,
                `সিএসএস এর border প্রোপার্টির ব্যবহার জানতে আমাদের সিএসএস বর্ডার টিউটোরিয়াল ওয়েব পেজটি ব্রাউজ করুন।`,
                `এই কোডের ফলে double border প্রদর্শিত হবে। এর কারন টেবিলের th এবং td এর নিজস্ব বর্ডার। টেবিলে single বর্ডার প্রদর্শন করতে হলে Collapse Border প্রপার্টি ব্যবহার করতে হবে।`
            ]},
            {
                head:'border-collapse প্রোপার্টি',
                text:[`সিএসএস border-collapse প্রপার্টি ব্যবহার করার ফলে টেবিলের বর্ডার single বা আলাদা আলাদা ভাবে প্রদর্শিত হয়।` ,
                `টেবিলে border-collapse প্রপার্টি ব্যবহার করে নিচে একটি উদাহরন দেখুন।`     
        ],
        input:[
            `উদাহরণ`,
            `table {`,
               ` border-collapse: collapse;`,
               `}`,

             `table, th, td {`,
             `  border: 2px solid teal;`,
             `}`
             
        ]
            },
            {
                head:'border-spacing প্রোপার্টি',
                text:[`সিএসএস border-spacing প্রপার্টি ব্যবহার করে টেবিলের ঘর গুলো এবং বর্ডার এর মধ্যস্থিত দূরত নির্ধারণ করা যায়। তবে এর জন্য অবশ্যই সিএসএস এর border-spacing প্রোপার্টির মান বা value separate নির্ধারিত করতে হবে।`  ,
                `border-spacing প্রপার্টির মান হতে পারে px, cm, em ইত্যাদি।` ,
                `নিছে একটি উদাহরন দেখুন, যেখানে টেবিলে border-collapse প্রপার্টি ব্যবহার করা হয়েছে।`   
        ],
        input:[
            `উদাহরণ`,
            `#table_1 {`,
               `  border-collapse: separate;`,
               `  border-spacing: 15px;`,
               `}`,

               `#table_2 {`,
               `  border-collapse: separate;`,
               `  border-spacing: 15px;`,
               `}`
            
        ]
            },
            {
                head:'width এবং height প্রোপার্টি',
                text:[`সিএসএস এর width এবং height প্রোপার্টি ব্যবহার করে কোন এইচটিএমএল টেবিল এর আকার অর্থাৎ দৈর্ঘ্য ও প্রস্থ নির্ধারণ করা যায়।`,
                `width এবং height প্রোপার্টির মান বা value বিভিন্ন ভাবে নির্ধারণ করা যায়। যেমন - পিক্সেল বা px এর সাহায্যে, শতকরা বা % পদ্ধতি ইত্যাদি ব্যবহার করে।`,
                `width এবং height প্রোপার্টি ব্যবহার করে নিছে একটি উদাহরন দেখুন।`        
        ],
        input:[
            `উদাহরণ`,
                `table {`,
                        ` width:100%;`,
                    `}`,
                    `th {`,
                    ` height:50px;`,
                `}`
        ]
            },
            {
                head:'vertical-align প্রোপার্টি',
                text:[`সিএসএস এর vertical-align প্রপার্টি ব্যবহার করে টেবিল এর ঘর গুলতে অর্থাৎ <th> এবং <td> এলিমেন্ট এর মধ্যস্থিত কোন কন্টেন্ট যেমন লেখা বা text এর উলম্ব অবস্থান নির্ধারণ করা যায়।`,
                `vertical-align প্রপার্টির মান বা value হতে পারে top, middle, এবং bottom.`,
                `সিএসএস এর vertical-align প্রপার্টি ব্যবহার করে নিচে একটি উদাহরন দেখুন।`       
        ]
        ,
        input:[
            `উদাহরণ`,
        `td {`,
       ` height : 100px`,
       ` vertical-align: middle;`,
       `}`
       
    ]
            },
            {
                head:'text-align প্রোপার্টি',
                text:[`সিএসএস এর text-align প্রপার্টি ব্যবহার করে টেবিল এর ঘর গুলতে অর্থাৎ <th> এবং <td> এলিমেন্ট এর মধ্যস্থিত কোন কন্টেন্ট যেমন লেখা বা text এর আনুভূমিক অবস্থান নির্ধারণ করা যায়।`,
                `text-align প্রপার্টির মান বা value হতে পারে left, right, এবং center.`,
                `সিএসএস এর text-align প্রপার্টি ব্যবহার করে নিচে একটি উদাহরন দেখুন।`
        ],
        input:[
            `উদাহরণ`,
        `th {`,
       ` text-align: center;`,

       `}`
    ]
            },
            {
                head:'padding প্রোপার্টি',
                text:[`সিএসএস এর padding প্রোপার্টি ব্যবহার করে কোন টেবিলের বর্ডার এবং কন্টেন্ট যেমন - কোন লেখা বা text, ছবি বা image ইত্যাদির মাঝে ফাকা স্থান নির্ধারণ করা যায়। এ জন্য এইচটিএমএল এর <th> এবং <td> এলিমেন্ট এর সাথে padding প্রোপার্টি ব্যবহার করতে হয়।`,
                `নিচে টেবিলে padding প্রোপার্টি ব্যবহার করে একটা উদাহরণ দেখুন।`
        ],
        input:[
            `উদাহরণ`,
        `td {`,
       `  padding:15px;`,

       `}`
    ]
            },
       
        ]
    },
    {
        id:16,
        title:'সিএসএস ডাইমেনসন - CSS Dimension',
        category:'সিএসএস ডাইমেনসন ',
        desc:[
            'সিএসএস এর dimension প্রোপার্টি গুলো ব্যবহার করে কোন এইচটিএমএল এলিমেন্টের উচ্চতা বা height এবং প্রস্থ বা width নির্ধারণ করা যায়।',
            
        ],
        titleTwo: [
            {
                head:'dimension প্রোপার্টি',
                            text:[`সিএসএস এর dimension প্রোপার্টি গুলো হল - height, max-height, max-width, width, min-height এবং min-width।`
                       
                        ]
            },
            {
                head:'height এবং width প্রোপার্টি',
                text:[`সিএসএস এর height এবং width প্রোপার্টি ব্যবহার করে কোন এলিমেন্ট এর উচ্চতা বা height এবং প্রস্থ বা width নির্ধারণ করা যায়।`,
                `নিছে একটি উদাহরন দেখুন, যেখানে height এবং width প্রোপার্টি ব্যবহার করা হয়েছে।`       

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               ` height: 300px;`,
               `width: 50%;`,
               `  background-color: forestgreen;`,
               `}
               `
        ],

       
            },
            {
                head:'max-height প্রোপার্টি',
                text:[`সিএসএস এর max-height প্রোপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্ট এর জন্য সর্বোচ্চ উচ্চতা নির্ধারণ করা যায়।` ,
                `নিছে একটি উদাহরন দেখুন, যেখানে max-height প্রোপার্টি ব্যবহার করা হয়েছে।`     
        ],
        input:[
            `উদাহরণ`,
            `p {`,
               ` max-height: 30px;`,
               ` overflow: auto`,
               `}`

            
             
        ]
            },
            {text:[`এখানে overflow প্রোপার্টি ব্যবহার করতে হয়, যাতে এলিমেন্ট এর উচ্ছতা বা height বেসি হলে, তা overflow হতে পারে। যদি এলিমেন্ট এর উচ্চতা, max-height প্রোপার্টি এর থেকে বেসি হয় তবে, max-height প্রোপার্টির মান কোন প্রভাব ফেলবে না।`]}
         
           
       
        ]
    },
    {
        id:17,
        title:'সিএসএস বক্স মডেল - CSS Box Model',
        category:'বক্স মডেল',
        desc:[
            'এইচটিএমএল এলিমেন্ট গুলোকে একটি বক্স হিসেবে ধরে নিলে, ওয়েব পেজ ডিজাইনে বিশেষ সুবিধা পাওয়া যায়। বিশেষ করে কোন ওয়েব পেজের লেআউট ডিজাইন করতে এটা বেশ সুবিধাজনক একটি পদ্ধতি।',
            
        ],
        titleTwo: [
            {
                head:'বক্স মডেল',
                            text:[`সিএসএস বক্স মডেল হল এইচটিএমএল এলিমেন্টের চারপাশের বর্ডার, মার্জিন, প্যাডিং এবং এলিমেন্ট বা কন্টেন্ট এর সম্মিলিত অবস্থা। বক্স মডেল প্রপার্টিগুলো কোন কন্টেন্ট এর চারপাশে বর্ডার, মার্জিন, প্যাডিং বা আউটলাইন নির্ধারণ করে।`,
                            `বক্স মডেলের বিভিন্ন অংশের বর্ণনা -`,
                            `Margin - বর্ডারের চারপাশের ফাকা স্থান নির্ধারণ করাই হল মার্জিন। মার্জিনের পৃষ্ঠদেশ বা background এ কোন রঙ ব্যবহার করা যায় না, এটা পুরোপুরি transparent বা স্বচ্ছ।`,
                            `Border - কন্টেন্ট প্যাডিং এর চারপাশে অর্থাৎ মার্জিন এবং প্যাডিং এর মধ্যস্থানেই বর্ডার অবস্থান করে। পৃষ্ঠদেশ বা background এর রং, বর্ডার এর উপর প্রভাব বিস্তার করে।`,
                            `Border - কন্টেন্ট প্যাডিং এর চারপাশে অর্থাৎ মার্জিন এবং প্যাডিং এর মধ্যস্থানেই বর্ডার অবস্থান করে। পৃষ্ঠদেশ বা background এর রং, বর্ডার এর উপর প্রভাব বিস্তার করে।`,
                            `Content - বক্স মডেলের কোন কন্টেন্ট হল টেক্সট, ছবি ইত্যাদি, অর্থাৎ যেগুলো ওয়েব পেজে প্রদর্শিত হয়।`,
                            `নিচে কিছু সিএসএস স্টাইল কোড দেখুন, যেখানে একটি পরিপূর্ণ বক্স মডেলের উদাহরন তৈরি করা হয়েছে।`
                       
                        ],
                        input:[
                            `উদাহরণ`,
                            `div {`,
                               ` height: 300px;`,
                               ` width: 50%;`,
                               ` padding: 14px;`,
                               ` margin: 14px;`,
                               `  border: 5px dotted tomato;`,
                               `}
                               `
                        ],
            },
            {
                head:'বক্স মডেলের গাণিতিক হিসেব',
                text:[`সিএসএস দিয়ে যখন আমরা কোন এইচটিএমএল এলিমেন্টের width এবং height নির্ধারণ করি, তখন আমরা আসলে কেবল কন্টেন্ট, যেমন - কোন ছবি, কোন পারাগ্রাফ ইত্যাদির জন্য পুরো width এবং height নির্ধারণ করি। কিন্তু ওয়েব পেজে সুন্দরভাবে কোন কন্টেন্ট প্রদর্শনের জন্য অবশ্যই প্যাডিং, বর্ডার এবং মার্জিন নির্ধারণ করতে হবে।`,
                `কোন এইচটিএমএল এলিমেন্টের সঠিক আকার জানতে হলে, বর্ডার, প্যাডিং এবং মার্জিন ও হিসেব করতে হবে।`       

        ],
       

       
            },
            
           
       
        ]
    },
    {
        id:18,
        title:'সিএসএস বর্ডার - CSS Border',
        category:'সিএসএস বর্ডার',
        desc:[
            'কোন এইচটিএমএল এলিমেন্টের বর্ডার এর স্টাইল, রঙ ইত্যাদি নির্ধারণ করতে সিএসএস এর berder প্রপার্টি ব্যাবহৃত হয়',
            
        ],
        titleTwo: [
            {
                head:'সকল বর্ডার প্রোপার্টি',
                            text:[`যে সকল প্রোপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্ট এর স্টাইল করা যায় সেগুলো হল - border-width, border-style ও border-color.`,
                            `সকল প্রোপার্টি ব্যবহার করে নিচে একটি উদাহরন দেখুন।`
                       
                        ],
                        input:[
                            `উদাহরণ`,
                            `div {`,
                               `  border-width: 5px;`,
                               `  border-style: solid;`,
                               `  border-color: blue;`,
                               `}
                               `
                        ],
            },
            {
                head:'border-width প্রোপার্টি',
                text:[`সিএসএস এর border-width প্রোপার্টি ব্যবহার করে কোন এলিমেন্ট এর চারপাশে বর্ডার এর প্রস্থ বা width নির্ধারণ করা হয়। এই প্রোপার্টির মান বা value নির্ধারণ করা যায় px, em, cm, % ইত্যাদি একক বা unit ব্যবহার করে।`,
                `ভিভিন্ন রকম মান ব্যবহার করে, border-width প্রোপার্টির একটি উদাহরন নিচে দেখুন।`       

        ],
        input:[
            `উদাহরণ`,
            `div.px {`,
               `    border-width: 5px;border-style: solid;border-color: blue;`,
               `}
               `,
               `div.cm {`,
               `    border-width: 5px;border-style: solid;border-color: blue;`,
               `}
               `,
               `div.em {`,
               `    border-width: 5px;border-style: solid;border-color: blue;`,
               `}
               `
        ],

       
            },
            
            {
                head:'border-style প্রোপার্টি',
                text:[`সিএসএস এর border-style প্রোপার্টি ব্যবহার করে কোন এলিমেন্ট এর চারপাশের বর্ডার এর প্রকার বা style নির্ধারণ করা হয়। এই প্রোপার্টির মান বা value ৯ প্রকার হতে পারে, যেমন - solid, dotted, double ইত্যাদি।`,
                `বিভিন্ন রকম মান ব্যবহার করে, border-style প্রোপার্টির একটি উদাহরন নিচে দেখুন।`       

        ],
        input:[
            `উদাহরণ`,
            `div.px {`,
               `      border-width: 5px;border-style: solid;border-color: blue;`,
               `}
               `,
               `div.cm {`,
               `      border-width: 1.5cm;border-style: dotted;border-color: blue;`,
               `}
               `,
               `div.em {`,
               `   border-width: 1.5em;border-style: double;border-color: blue;`,
               `}
               `
        ],

       
            },
            {
                head:'border-style প্রোপার্টির মান',
                text:[`কোন প্রকার স্টাইলের বর্ডার, এলিমেনটের সাথে প্রদর্শিত হবে তা নির্ধারণ করা হয় berder প্রপার্টির মাধ্যমে। berder প্রপার্টিতে যে সকল মান বা value ব্যবহার করা যায়, এগুলো হল - dotted, dashed, solid, double, groove, ridge, ridge, inset ও outset.`,
                `কিন্তু যদি কোন বর্ডার প্রয়োজন না হয় তবে বর্ডার স্টাইল হবে none, তবে যদি কোন বর্ডার স্টাইলই উল্লেখ করা না হয় তাহলে কোন বর্ডারই প্রদর্শিত হবে না অর্থাৎ এটা difolt মান.`       

        ]
       

       
            },
            {
                head:'border-color প্রোপার্টি',
                text:[`সিএসএস এর border-color প্রোপার্টি ব্যবহার করে বর্ডার এর রঙ নির্ধারণ করা যায়। সিএসএস সমর্থিত সকল পদ্ধতি ব্যবহার করে, border-color প্রোপার্টির মান নির্ধারণ করা যায়।`,
                `বিভিন্ন রকম মান ব্যবহার করে, নিচে border-color প্রোপার্টির একটি উদাহরন দেখুন।`       

        ],
        input:[
            `উদাহরণ`,
            `div.name {`,
               `      border-color: blue;`,
               `}
               `,
               `div.hex {`,
               `      border-color: #000000;`,
               `}
               `,
               `div.rgba {`,
               `  border-color: rgb(0,0,255);`,
               `}
               `
        ],

       
            },
            {
                head:'শর্টহ্যান্ড প্রোপার্টি - border',
                text:[`সিএসএস এর বর্ডার প্রোপার্টি অর্থাৎ border-width,border-style ও border-color এই প্রোপার্টি গুলোর শর্টহ্যান্ড প্রোপার্টি হল border`,
                `সিএসএস border প্রোপার্টির সিনট্যাক্স নিচে দেখুন।` ,
                `silector {border: width style color;}`,
                `এক্ষেত্রে প্রথম মানটি বর্ডার এর প্রস্থ বা width, দ্বিতীয়টি স্টাইল এবং তৃতীয়টি বর্ডার এর রঙ নির্ধারণ করে।`,
                `নিচে একটি উদাহারন দেখুন, যেখানে border প্রোপার্টি ব্যবহার করা হয়েছে।`      

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               ` border: 5px dotted red;`,
               `}
               `
        ],

       
            }
        ]
    },
    {
        id:19,
        title:'সিএসএস মার্জিন - CSS Margin',
        category:'সিএসএস মার্জিন',
        desc:[
            'কোন এইচটিএমএল এলিমেন্টের চারপাশের ফাকা স্থান নির্ধারণ করাই হল সিএসএস মার্জিন ব্যবহারের উদ্দেশ্য। এক কথায় আমরা লেখাপড়া করার সময় খাতার দুই বা চার পাশে যে, ফাঁকা স্থান বাদ রেখে লেখা শুরু করতাম, সেটাই হল মার্জিন।',
            
        ],
        titleTwo: [
            {
                head:'সিএসএস মার্জিন',
                            text:[`কোন এলিমেন্ট বর্ডারের চারপাশের ফাকা স্থান নির্দিষ্ট করে দেয়া হয় সিএসএস মার্জিন প্রপার্টি গুলো ব্যবহার করে। মার্জিনের পৃষ্ঠদেশ বা background কোন রঙ ব্যবহার করা যায় না, এটি পুরোপুরি স্বচ্ছ বা transparent অর্থাৎ অদৃশ্য হয়।`,
                            `ভিন্ন ভিন্ন মার্জিন প্রপার্টি ব্যবহার করে, স্বাধীনভাবে কোন এইচটিএমএল এলিমেন্ট এর চতুর্দিকে মার্জিন নির্ধারণ করা যায়। margin-left, margin-right, margin-top এবং margin-bordar.`,
                            `সকল মার্জিন প্রোপার্টি ব্যবহার করে নিচে একটি উদাহরন দেখুন।`
                       
                        ],
                        input:[
                            `উদাহরণ`,
                            `p {`,
                               `  margin-left: 5px;`,
                               `  margin-right: 5px;`,
                               `  margin-top: 5px;`,
                               `  margin-bottom: 5px;`,
                    
                               `}
                               `
                        ],
            },
            {
                head:'মার্জিন প্রোপার্টির মান বা value',
                text:[`বিভিন্ন একক ব্যবহার করে সিএসএস এর মার্জিন প্রোপার্টি গুলোর মান নির্ধারণ করা যায়।, যেমন - নির্দিষ্ট বা fixed মান ব্যবহার করে কিংবা শতকরা পদ্ধতিতে, ইত্যাদি।`,
                      `auto	ব্রাউজার মার্জিন নির্ধারণ করে। এতে ব্রাউজারের উপরেই ফলাফল নির্ভর করে।
                      length	নির্দিষ্ট মানের(pixel, pt, em ইত্যাদিতে) মার্জিন নির্ধারণ করে।
                      %	ধারনক্রিত এলিমেনটের শতকরা হারের ওপর মার্জিন নির্ধারণ করে।`

        ]
     

       
            },
            
            {
                head:'শর্টহ্যান্ড প্রপার্টি - margin',
                text:[`সিএসএস এর এই margin-left, margin-right, margin-top এবং margin-bordar প্রোপার্টি গুলোর শর্টহ্যান্ড হল margin প্রোপার্টি। শর্টহ্যান্ড প্রপার্টির মাধ্যমে একবার মাত্র margin প্রপার্টি ব্যবহার করেও সবগুলো মার্জিন নির্দিষ্ট করে দেয়া যায়।`,
                `নিচে সিএসএস এর margin শর্টহ্যান্ড প্রোপার্টির সিনট্যাক্স দেখুন।`  ,
                `silector {margin: value;}`     

        ],
       

       
            },
            {
                head:'margin প্রোপার্টি - 4টি মান বা value',
                text:[`margin প্রোপার্টি তে 4 টি মান বা value উল্লেখ করা যায়। এক্ষেত্রে প্রথম মানটি এইচটিএমএল এলিমেন্ট এর ওপর দিকের মার্জিন, দ্বিতীয় মানটি ডান দিকের মার্জিন, তৃতীয়টি নিচের দিকের মার্জিন এবং চতুর্থটি বাঁ দিকের মার্জিন নির্ধারণ করে।`,
                `সিএসএস এর margin শর্টহ্যান্ড প্রোপার্টিতে 4 টি মান বা value ব্যবহার করে নিচে একটি উদাহরন দেখুন।`       

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               `       margin: 40px 60px 80px 100px;`,
               `}
               `
        ],

       
            },
            {
                head:'margin প্রোপার্টি - 3টি মান বা value',
                text:[`margin প্রোপার্টি তে 3 টি মান বা value উল্লেখ করা যায়। এক্ষেত্রে প্রথম মানটি এইচটিএমএল এলিমেন্ট এর ওপর দিকের মার্জিন, দ্বিতীয় মানটি ডান ও বাঁ দিকের মার্জিন এবং তৃতীয়টি নিচের দিকের মার্জিন নির্ধারণ করে।`,
                `সিএসএস এর margin শর্টহ্যান্ড প্রোপার্টিতে 3 টি মান বা value ব্যবহার করে নিচে একটি উদাহরন দেখুন।`       

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               `       margin: 40px 60px 80px ;`,
               `}
               `
        ],
       
            },
            {
                head:'margin প্রোপার্টি - 2টি মান বা value',
                text:[`margin প্রোপার্টি তে 2 টি মান বা value উল্লেখ করা যায়। এক্ষেত্রে প্রথম মানটি এইচটিএমএল এলিমেন্ট এর ওপর ও নিচের দিকের মার্জিন এবং দ্বিতীয় মানটি ডান ও বাঁ দিকের মার্জিন নির্ধারণ করে।`, 
                `সিএসএস এর margin শর্টহ্যান্ড প্রোপার্টিতে 2 টি মান বা value ব্যবহার করে নিচে একটি উদাহরন দেখুন।`,
                  

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               `       margin: 40px 60px ;`,
               `}
               `
        ],

       
            }
        ]
    },
    {
        id:20,
        title:'সিএসএস প্যাডিং - CSS Padding',
        category:'সিএসএস প্যাডিং',
        desc:[
            'কোন এইচটিএমএল এলিমেন্টের বর্ডার এবং এলিমেন্ট কন্টেন্টের মধ্যকার ফাঁকা স্থান নির্ধারণ করতে সিএসএস এর প্যাডিং প্রোপার্টি গুলো ব্যবহার করা হয়।',
            
        ],
        titleTwo: [
            {
                head:'সিএসএস প্যাডিং',
                            text:[`সিএসএস এর প্যাডিং প্রোপার্টি গুলো, সুনির্ধারিতভাবে নির্দিষ্ট করে দেয় কোন কন্টেন্টের চারপাশের অর্থাৎ বর্ডারের ভেতর ফাঁকা স্থান। অর্থাৎ সিএসএস প্যাডিং প্রপার্টি এলিমেন্ট ও বর্ডার এর মধ্যবর্তী ফাঁকা স্থান নির্ধারণ করে। প্যাডিং এর পৃষ্ঠদেশ বা background এ কোন রঙ ব্যবহার করা যায় না, এটি পুরোপুরি স্বচ্ছ বা transparent অর্থাৎ অদৃশ্য হয়।`,
                            `ভিন্ন ভিন্ন প্যাডিং প্রপার্টি গুলো ব্যবহার করে, স্বাধীনভাবে কোন এইচটিএমএল এলিমেন্ট এর চতুর্দিকে প্যাডিং নির্ধারণ করা যায়। প্যাডিং প্রোপার্টি গুলো হল - padding-left, padding-right, padding-top এবং padding-bottom.`,
                            `সকল প্যাডিং প্রোপার্টি ব্যবহার করে নিচে একটি উদাহরন দেখুন।`
                       
                        ],
                        input:[
                            `উদাহরণ`,
                            `p {`,
                               `  padding-left: 5px;`,
                               `  padding-right: 5px;`,
                               `  padding-top: 5px;`,
                               `  padding-bottom: 5px;`,
                    
                               `}
                               `
                        ],
            },
            {
                head:'প্যাডিং প্রোপার্টির মান বা value',
                text:[`বিভিন্ন একক ব্যবহার করে সিএসএস এর প্যাডিং প্রোপার্টি গুলোর মান নির্ধারণ করা যায়।, যেমন - নির্দিষ্ট বা fixed মান ব্যবহার করে কিংবা শতকরা পদ্ধতিতে, ইত্যাদি।`,
                      `length	নির্দিষ্ট মানেরে প্যাডিং নির্ধারণ করার জন্য px, pt, cm ইত্যাদি ব্যবহার করা হয়। যদি কোন মান উল্লেখ না করা হয়, তবে স্বয়ংক্রিয়ভাবে মান 0px হবে।
                      %	কোন এলিমেনটের প্রস্থ অনুযায়ী শতকরা অনুপাতে প্যাডিং নির্দিষ্ট করার জন্য এই পদ্ধতি ব্যবহার করা হয়। যেমন- ১০%, ১৫% ইত্যাদি।
                      initial	
                      inherit`

        ]
     

       
            },
            
            {
                head:'শর্টহ্যান্ড প্রপার্টি - padding',
                text:[`সিএসএস এর এই padding-left, padding-right, padding-top এবং padding-bordar প্রোপার্টি গুলোর শর্টহ্যান্ড হল padding প্রোপার্টি। একবার মাত্র শর্টহ্যান্ড প্রপার্টি ব্যবহার করে এলিমেন্ট এর সকল দিকের প্যাডিং নির্ধারণ করা যায়।`,
                `নিচে সিএসএস এর padding শর্টহ্যান্ড প্রোপার্টির সিনট্যাক্স দেখুন।`,  
                `silector {padding: value;}`     

        ],
       

       
            },
            {
                head:'padding প্রোপার্টি - 4টি মান বা value',
                text:[`padding প্রোপার্টি তে 4 টি মান বা value উল্লেখ করা যায়। এক্ষেত্রে প্রথম মানটি এইচটিএমএল এলিমেন্ট এর ওপর দিকের প্যাডিং, দ্বিতীয় মানটি ডান দিকের প্যাডিং, তৃতীয়টি নিচের দিকের প্যাডিং এবং চতুর্থটি বাঁ দিকের প্যাডিং নির্ধারণ করে।`,
                `সিএসএস এর padding শর্টহ্যান্ড প্রোপার্টিতে 4 টি মান বা value ব্যবহার করে নিচে একটি উদাহরন দেখুন।`       

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               `       padding: 40px 60px 80px 100px;`,
               `}
               `
        ],

       
            },
            {
                head:'padding প্রোপার্টি - 3টি মান বা value',
                text:[`padding প্রোপার্টি তে 3 টি মান বা value উল্লেখ করা যায়। এক্ষেত্রে প্রথম মানটি এইচটিএমএল এলিমেন্ট এর ওপর দিকের প্যাডিং, দ্বিতীয় মানটি ডান ও বাঁ দিকের প্যাডিং এবং তৃতীয়টি নিচের দিকের প্যাডিং নির্ধারণ করে।`,
                `সিএসএস এর padding শর্টহ্যান্ড প্রোপার্টিতে 3 টি মান বা value ব্যবহার করে নিচে একটি উদাহরন দেখুন।`       

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               `       padding: 40px 60px 80px ;`,
               `}
               `
        ],
       
            },
            {
                head:'padding প্রোপার্টি - 2টি মান বা value',
                text:[`padding প্রোপার্টি তে 2 টি মান বা value উল্লেখ করা যায়। এক্ষেত্রে প্রথম মানটি এইচটিএমএল এলিমেন্ট এর ওপর ও নিচের দিকের প্যাডিং এবং দ্বিতীয় মানটি ডান ও বাঁ দিকের প্যাডিং নির্ধারণ করে।`, 
                `সিএসএস এর padding শর্টহ্যান্ড প্রোপার্টিতে 2 টি মান বা value ব্যবহার করে নিচে একটি উদাহরন দেখুন।`,
                  

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               `       padding: 40px 60px ;`,
               `}
               `
        ],

       
            }
        ]
    },
    {
        id:21,
        title:'সিএসএস ডিসপ্লে - CSS Display',
        category:'সিএসএস ডিসপ্লে',
        desc:[
           `সিএসএস এর display প্রপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্ট কিভাবে প্রদর্শিত বা display হবে তা নির্ধারণ করা হয় এবং visibility প্রপার্টি নির্ধারণ করে এলিমেন্ট প্রদর্শিত হবে না অদৃশ্য থাকবে।
           কোন ওয়েব পেজের লেআউট ডিজাইন করতে এই দুটি প্রোপার্টি বেশ গুরুত্বপূর্ণ ভুমিকা পালন করে থাকে।`,
            
        ],
        titleTwo: [
            {
                head:'display প্রোপার্টি',
                            text:[`সিএসএস এর display প্রোপার্টি, নির্ধারণ করে কোন এইচটিএমএল এলিমেন্ট কিভাবে প্রদর্শিত হবে। সকল এইচটিএমএল এলিমেন্ট এর ই, তাদের প্রকারভেদ এর ওপর নির্ভর করে, একটি default মান বা value আছে। একটি এইচটিএমএল এলিমেন্ট হয় bএইচটিএমএল ব্লক ও ইনলাইন এলিমেন্ট গুলো সম্পর্কে জানতে আমাদের এইচটিএমএল ব্লক ও ইনলাইন এলিমেন্ট টিউটোরিয়াল ওয়েব পেজটি ব্রাউজ করুন।`
                            
                       
                        ]
            },
            {
                head:'ব্লক লেভেল এলিমেন্ট',
                text:[`ব্লক-লেভেল এলিমেন্ট গুলো সাধারণ ভাবে বাম থেকে ডান দিকের সমস্ত স্থান টুকু সংরক্ষণ করে রাখে অর্থাৎ লাইনের সম্পূর্ন প্রস্থ বা width দখল করে নেয়, এই এলিমেন্টকে আপনি লাইনের বা দিকে বা ডান দিকে, যেদিকেই স্থাপন করেন না কেন, সকল ক্ষেত্রেই লাইনের সম্পূর্ন প্রস্থ সংরক্ষন করে। ব্লক-লেভেল এলিমেন্ট গুলো সব সময় একটি নতুন লাইন তৈরি করে।`,
                      `নিচে কয়েকটি ব্লক লেভেল এলিমেন্ট এর উদাহরন দেখুন।`,
                      `<form>`,
                      `<h1>...<h6>`,
                      `<div>`,
                      `<li>`,
                      `<hr>`

        ]
     

       
            },
            
            {
                head:'ইনলাইন এলিমেন্ট',
                text:[`ইনলাইন এলিমেন্ট গুলো কেবল মাত্র প্রয়োজন অনুযায়ী প্রস্থ বা width সংরক্ষন বা দখল করে। এই এলিমেন্ট গুলো কোন নতুন লাইন তৈরি করে না।`,
                `নিচে কয়েকটি ইনলাইন এলিমেন্ট এর উদাহরন দেখুন।` ,
                `<br/>`,
                `<img>`,
                `<input>`,
                `<a>`,
                `<map>`    

        ],
       

       
            },
            {
                head:'এলিমেন্ট কিভাবে প্রদর্শিত হয়?',
                text:[`কোন inline এলিমেন্টকে block এলিমেন্টে কিংবা block এলিমেন্টকে inline এলিমেন্টে রুপান্তর করে ওয়েব পেজকে একটি নির্দিষ্ট রূপে প্রদর্শন করা যায় এবং এই কাজটি করা যায় web standard অনুসরন করেই।`,
                `<li> এর মত inline এলিমেন্টকে block এলিমেন্ট রূপে ব্যবহার করার জন্য নীচে একটি উদাহরন দেখুন।`       

        ],
        input:[
            `উদাহরণ`,
            `li {`,
               `      display : inline`,
               `}
               `
        ],

       
            },
            {
                text:[
                    `<span> এর মত block এলিমেন্টকে inline এলিমেন্ট রূপে ব্যবহার করার জন্য নীচে একটি উদাহরন দেখুন।`,

                ],
                input:[
                    `উদাহরণ`,
            `span {`,
               `      display : block`,
               `}
               `
                ],
            },
            {
                head:'display এবং visibility প্রোপার্টি',
                text:[`display প্রপার্টির মান বা value none নির্ধারণ করে অথবা visibility প্রপার্টির মান hidden নির্ধারণ করে কোন এলিমেন্ট লুকানো বা hide করা যায়। তবে এই দুই পদ্ধতি কিন্তু ভিন্ন ভিন্ন ফল প্রদান করে।`,
                `visibility প্রপার্টি ব্যবহার করে তার মান বা value যদি hidden নির্ধারণ করা হয় তাহলে তা কোন এলিমেন্টকে hide করবে ঠিকই কিন্তু পূর্বের স্থান বা space দখল বা reserve করে রাখবে। এতে এলিমেন্টটি hide হলেও তা কিন্তু leyout এর ওপর প্রভাব রাখে।`,
                `display প্রপার্টি ব্যবহার করে তার মান বা value যদি none নির্ধারণ করা হয় তাহলে তা কোন এলিমেনটকে hide করবে এবং পূর্বের স্থান বা space দখল বা reserve করে রাখবে না অর্থাৎ মনে হবে যেন সেখানে কোন এলিমেন্ট বা কন্টেন্ট নেই। display প্রপার্টি ব্যবহারের ফলে এলিমেনটটি hide হবে এবং তা leyout এর ওপর কোন প্রভাব রাখে না।`       

        ],
        

       
            }
        ]
    },
    {
        id:22,
        title:'সিএসএস পজিসন - CSS Position',
        category:'সিএসএস পজিসন',
        desc:[
           `সিএসএস এর position প্রপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্টের অবস্থান বা position নির্ধারণ করা যায়। একটি এইচটিএমএল এলিমেন্টের সাথে অন্য কোন এইচটিএমএল এলিমেন্ট এর অবস্থান কি রকম হবে বা যদি কোন এইচটিএমএল এলিমেন্ট এর আকার বড় হয় তবে তার অবস্থান কি রকম হবে তা নির্ধারণ করা হয় সিএসএস এর position প্রপার্টি ব্যবহার করে।`,
            
        ],
        titleTwo: [
            {
                head:'position প্রোপার্টি',
                            text:[`সিএসএস এর position প্রপার্টি, কোন এইচটিএমএল এলিমেন্ট এর অবস্থান নির্ধারণ করে। সঠিক ও সুন্দর ভাবে কোন ওয়েব পেজ ডিজাইন করার জন্য এইচটিএমএল এলিমেন্ট গুলোর সঠিক অবস্থান খুব গুরুত্বপূর্ণ।`,
                            `যে সকল মান বা value এই প্রোপার্টির সাথে ব্যবহার করা যায়, সেগুলো হল - static, relative, fixed, absolute এবং sticky.`,
                            `top, bottom, left এবং right, এই সিএসএস প্রপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্টের অবস্থান নির্ধারণ করা যায়। কিন্তু যতক্ষণ পর্যন্ত position প্রপার্টি নির্ধারণ করা না হয় ততক্ষণ এই প্রপার্টি গুলো কাজ করবে না।`,
                           
                            
                       
                        ]
            },
            {
                head:'static অবস্থান',
                text:[`এইচটিএমএল এলিমেন্টগুলোর সাধারন এবং স্বাভাবিক অবস্থান বা position ই হল Static Position. এইচটিএমএল এলিমেন্ট গুলোর পূর্ব-নির্ধারিত বা default ভাবেই Static অবস্থান বা position এ প্রদর্শিত হয়। কোন ওয়েব পেজের স্বাভাবিক প্রদর্শন নিয়মই হল Static Positioning.`,
                      `Static অবস্থানে থাকা এইচটিএমএল এলিমেন্টগুলো top, bottom, left এবং right, এই সকল প্রপার্টি দ্বারা প্রভাবিত হয় না। অর্থাৎ এই প্রোপার্টি গুলো সিএসএস স্টাইল কোডে লিখলেও কোন কাজ করবে না। position: static; ব্যবহার করলে এগুলো নিষ্ক্রিয় থাকবে।`,
                      

        ]
     

       
            },
            
            {
                head:'relative অবস্থান',
                text:[`এইচটিএমএল এলিমেন্টগুলোর স্বাভাবিক অবস্থানের সাপেক্ষে top, bottom, left এবং right, এই প্রপার্টি গুলো ব্যবহার করে কোন এইচটিএমএল এলিমেন্টের অবস্থান বা position নির্ধারণ করতে position: relative; মান ব্যবহার করা হয়। relative positioned এলিমেন্ট হল কোন এইচটিএমএল এলিমেন্ট এর এমন একটি অবস্থান বা position যখন এইচটিএমএল এলিমেন্টগুলোর স্বাভাবিক অবস্থানের সাথে relative অবস্থায় থাকে।`,
                `static এবং relative অবস্থান এর মূল পার্থক্য হল static অবস্থানের ক্ষেত্রে top, bottom, left এবং right প্রপার্টি গুলো নিষ্ক্রিয় থাকে আর relative অবস্থান এর ক্ষেত্রে এই প্রপার্টি গুলোর দ্বারাই কোন এইচটিএমএল এলিমেন্টের অবস্থান বা position নির্ধারিত হয়।` ,
                `relative অবস্থানে থাকা প্রপার্টির ক্ষেত্রে সকল হিসাব করতে হয় ঐ এইচটিএমএল এলিমেন্টের স্বাভাবিক অবস্থান থেকে অর্থাৎ কোন অবস্থান বা position না করা হলে এলিমেন্টটি যেখানে অবস্থান করতো সেখান থেকে।`,
                  

        ],
        input:[
            `উদাহরণ`,
            `h2.left {`,
               `      left : -20px`,
               `      position :relative`,
               `}
               `
        ],

       
            },
            {
                head:'fixed অবস্থান',
                text:[`fixed হল এমন একটি মান, যার জন্য কোন এইচটিএমএল এলিমেন্ট ওয়েব পেজ এর viewport এর সাথে relative ভাবে অবস্থান করে অর্থাৎ এইচটিএমএল এলিমেন্টটি স্ক্রীন এ স্থির কোন অবস্থানে থাকে। এক্ষেত্রে যদি ওয়েব পেজটি ওপর-নিচ বা scroll করলেও এইচটিএমএল এলিমেন্টটি স্থির থাকে। এক্ষেত্রে left, right, top এবং bottom প্রোপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্টকে অবস্থান নির্ধারণ করা যায়।`,
                `সিএসএস fixed মান ব্যবহার করে, নিচে একটি উদাহরন দেখুন।`       

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               `     position: fixed;`,
              ` bottom: 0;`,
               `right: 0;`,
              ` width: 200px;`,
               `border: 2px solid green;`,
               `}
               `
        ],

       
            },
            
            {
                head:'absolute অবস্থান',
                text:[`এইচটিএমএল এলিমেন্টগুলোর প্রকৃত অবস্থান নির্ধারণ করার জন্য absolute মান ব্যবহার করা হয়। কোন এইচটিএমএল এলিমেন্টে position: absolute; প্রোপার্টি ব্যবহার করা হলে, তার অবস্থান স্বাভাবিক ক্রমে নির্ধারিত হয় না। এক্ষেত্রে left, right, top এবং bottom প্রপার্টি গুলো ব্যবহার করে ঐ এলিমেন্টের অবস্থান নির্ধারণ করতে হয়।`,
                `আবার অন্য কোন এইচটিএমএল এলিমেন্টের ওপরেও ওভারল্যাপ করে ঐ এলিমেন্টের অবস্থান বা position নির্ধারণ করা যায়। absolute অবস্থানে রাখা এইচটিএমএল এলিমেন্ট গুলো অন্য এলিমেন্ট গুলোকে overlap করে।`       

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               `     position: absolute;`,
              ` top: 150px;`,
               `left: 100px;`,
             
               
               `}
               `
        ],

       
            },
            {
                head:'sticky অবস্থান',
                text:[`sticky অবস্থান হল ব্যবহারকারীর মাউস scroll এর ওপর নির্ভরশীল একটি অবস্থান। একটি এইচটিএমএল এর sticky অবস্থান হল relative এবং fixed অবস্থান এর সম্মিলিত রূপ, যা ব্যবহারকারীর মাউস scroll এর ওপর নির্ভর করে।`,
                `নিচে একটি উদাহরন দেখুন, যেখানে sticky অবস্থান ব্যবহার করা হয়েছে।`       

        ],
        input:[
            `উদাহরণ`,
            `div {`,
               `     position: sticky;`,
              ` top: 0;`,
               `left: 0;`,
             
               
               `}
               `
        ],

       
            },
            {
                head:'z-index প্রোপার্টি',
                text:[`কোন এইচটিএমএল এলিমেন্টটি সামনে প্রদর্শিত হবে এর কোন এইচটিএমএল এলিমেন্টটি সেই এলিমেন্টের পরে বা পেছনে প্রদর্শিত হবে তা নির্ধারণ করা হয় z-index প্রোপার্টি ব্যবহার করে। এর মান ঋণাত্মক অর্থাৎ -ve হতে পারে। সর্বদা বেশি মান বা value এর এলিমেন্টটি সামনে প্রদর্শিত হয়।`,
                `static অবস্থান ছাড়া অন্য সকল অবস্থান অর্থাৎ absolute, relative, fixed এবং sticky অবস্থানের জন্য z-index প্রোপার্টি কাজ করে।`       

        ],
        input:[
            `উদাহরণ`,
            `img.flower {`,
               `     position: absolute;`,
              ` top: 0;`,
               `left: 0;`,
               `z-index: -1`,
               
               `}
               `
        ],

       
            }
        ]
    },
]