export const htmldata = [
    {
        id:1,
        category:'এইচটিএমএল কি',
        title:`এইচটিএমএল কি – What is HTML in Bangla`,
        desc:['এইচটিএমএল বা HTML এর পূর্ণরূপ হল Hyper Text Markup Language. এইচটিএমএল (html) হল ওয়েব ডিজাইন এর মূল ভিত্তি যা দিয়ে ওয়েব পেজ তৈরি করা হয়। আপনি ওয়েব পেজ ডিজাইন করতে সিএসএস, জাভাস্ক্রিপ্ট, যেক্যুয়েরী বা অন্য যা কিছুই ব্যবহার করেন না কেন আপনাকে অবশ্যই এগুলো html এর মাধ্যমে ব্যবহার করতে হবে।',`এইচটিএমএল কোন প্রোগ্রামিং ল্যাঙ্গুয়েজ নয়, এটি একটি মার্কআপ ল্যাঙ্গুয়েজ যা কতগুলো মার্কআপ ট্যাগ এর সমষ্টি। অর্থাৎ এইচটিএমএলের এই প্রতিটি ট্যাগের আন্তর্জাতিক অর্থাৎ আদর্শিক ভাবে পূর্ব নির্ধারিত সুনির্দিষ্ট কাজ রয়েছে। ব্রাউজারে এইচটিএমএল কোড লোড হবার পর এই কোডগুলো তাদের নির্ধারিত কাজ করে। অর্থাৎ মার্কআপ ট্যাগগুলো ওয়েব পেজে কন্টেন্টের অবস্থান, প্রদর্শন ইত্যাদি নির্ধারণ করে। সহজভাবে কোন কন্টেন্ট কিভাবে প্রদর্শিত হবে,তা এইচটিএমএল ট্যাগ গুলো ব্রাউজারকে বলে দেয় ।`],
        titleTwo:[
           {
            head:'html কি কাজে লাগে?',
            text:[`ওয়েব পেজ তৈরি করা, ওয়েব পেজ এর বিভিন্ন কনটেন্ট ( যেমন টেক্সট, ইমেজ ইত্যাদি ) কে সুন্দরভাবে বিন্যাস করা, ডিজাইন করা এবং ওয়েব পেজ এর আউটলুক (outlook) দেওয়ার জন্যই এইচটিএমএল (html) ব্যবহার করা হয়।অর্থাৎ একটি ওয়েব পেজ তৈরি করা এবং বিভিন্ন ব্রাউজার ( যেমন মজিলা ফায়ারফক্স, ইন্টারনেট এক্সপ্লোরার ইত্যাদি ) তে প্রদর্শন করানো।`]
           },
           {
            head:'html ডকুমেন্ট অর্থাৎ ওয়েব পেজ',
            text:[`ওয়েব ব্রাউজার ( যেমন মজিলা ফায়ারফক্স, গুগল ক্রোম ইত্যাদি ) একটি html ডকুমেন্ট read করে এবং তা ওয়েব পেজ রুপে screen এ প্রদর্শন করে। ব্রাউজার html ট্যাগ প্রদর্শন করে না, ট্যাগ গুলোকে কন্টেন্ট অর্থাৎ ছবি, টেক্সট ইত্যাদি প্রদর্শনের মাধ্যম রূপে ব্যবহার করে। অর্থাৎ একটি html ডকুমেন্টই একটি ওয়েব পেজ।`]
           },
           {
            head:`এইচটিএমএলের ইতিহাস`,
            text:[`এইচটিএমএলের প্রথম ভার্সন অর্থাৎ এইচটিএমএল ১.০, ১৯৯৩ সালে Tim Berners-Lee দ্বারা লেখা বা তৈরি হয়েছিল। এর পরে আরও বেস কয়েকটি ভার্সন তৈরি করা হয়েছে। তবে সবথেকে বিস্তৃত পরিসরে বাবহিরিত এইচটিএমএল ভার্সন টি হল এইচটিএমএল ৪.০১, যা ১৯৯৯ সালে প্রকাশিত হয়। এবং এটি এইচটিএমএল এর একটি আদর্শিক ভার্সনও।


            সর্ব প্রথম এইচটিএমএল এর যে বর্ণনা সবার জন্য উন্মুক্ত হয়েছিল, তার নাম ছিল "HTML Tags", দেরিতে হলেও Mr. Lee এটাকে ১৯৯১ সালে সবার সাথে পরিচয় করিয়ে দিয়েছিলেন। এটাতে ১৮ টি এলিমেন্ট ছিল, যা আসলে এইচটিএমএল এর প্রথমিক এবং তুলনামূলক ডিজাইন ছিল।`,
          `এদের মধ্যে হাইপারলিংক ট্যাগ ছাড়া বাকি সব গুলোই SGMLguid এর মত ছিল, যা হল European Organization for Nuclear Research (CERN), Switzerland এর একটি অভ্যন্তরীণ Standard Generalized Markup Language (SGML) নির্ভর ডকুমেন্টেশন। এর থেকে ১১ টি ট্যাগ বর্তমান এইচটিএমএল ৪.০১ এ বিদ্যমান রয়েছে।`]
           }
        ]
    },
    {
        id:2,
        category:'এইচটিএমএল এলিমেন্ট',
        title:`এইচটিএমএল এলিমেন্ট - HTML Element`,
        desc:['এইচটিএমএল এলিমেনট হল স্টার্ট ট্যাগ থেকে শুরু করে ক্লোজিং ট্যাগ পর্যন্ত সমস্ত কিছু। ব্যাপারটা আরও ভালভাবে বোঝার জন্য আমরা একটি পারাগ্রাফ এর কথা বিবেচনা করি।',
        'কোন প্যারাগ্রাফ লিখতে হলে আমরা প্যারাগ্রাফ এর স্টার্টিং বা ওপেনিং ট্যাগ অর্থাৎ <p> দিয়ে শুরু করি তারপর প্যারাগ্রাফ এর বিষয়বস্তু এবং সর্বশেষে আমরা প্যারাগ্রাফ এর ক্লোজিং বা এন্ড ট্যাগ অর্থাৎ </p> দিয়ে শেষ করি।'
       ],
        titleTwo :[
          {
            text:[ `এখানে আমরা স্টার্টিং বা ওপেনিং ট্যাগের সাথে 'align'এট্রিবিউট ব্যবহার করেছি যার মান বা value নির্ধারণ করেছি 'left'. অর্থাৎ code টি দেখতে নিচের মত হয় –`],
            input:[
              ` উদাহরণ`,
                 `<p align="left">This is a paragraph.</p>`
   
             ],
          },
         
          {
            text:[`এটাই একটি এইচটিএমএল এলিমেনট। এইচটিএমএলের কোন ট্যাগের যখন পরিপূর্ণ ব্যবহার করা হয় তখন ঐ পুরো ট্যাগ এর ব্যবহারকে একটি এলিমেনট বলে।`]
          },
          {
            head:`এইচটিএমএল এলিমেনটের বৈশিষ্ট্য`,
            text:[`কোন এইচটিএমএল এলিমেনটের কিছু বৈশিষ্ট্য থাকে, নিছে আগুল দেখুন।`,
          `স্টার্ট ট্যাগ বা ওপেনিং ( Opening ) ট্যাগ দিয়ে শুরু হয়,`,
          `ক্লোজিং ট্যাগ বা এন্ড ( End ) ট্যাগ দিয়ে শেষ হয়,`,
          `স্টার্ট ও ক্লোজিং ট্যাগ এর মাঝে এলিমেনট কন্টেন্ট থাকে,`,
          `কিছু এলিমেনট স্টার্ট ট্যাগেই শেষ বা ক্লোজ হতে পারে যেমন - <image/> ট্যাগ,`,
          ]
          },
          {
            head:`Empty এলিমেন্ট`,
            text:[`কতগুলো এইচটিএমএল এলিমেন্ট আছে জেগুলোর কোন শেষ বা closeing ট্যাগ নেই। যেমন - <img>, <hr>, <br> ইত্যাদি। এগুলো কে empty ট্যাগ বলে।`]
          },
          {
            head:`Lowercase ট্যাগ ব্যবহার করুন`,
            text:[`এইচটিএমএল ট্যাগ গুলো কিন্তু কেজ সেন্সিটিভ নয় অর্থাৎ <H1> এবং <h1> ট্যাগ, ব্রাউজারে একই কাজ করবে।`,`এইচটিএমএল ৫.০ এর স্ট্যান্ডার্ডে Lowercase ট্যাগ ব্যবহার করার জন্য কোন রকম বাধ্য-বাদ্ধকতা নেই। কিন্তু W3C এইচটিএমএল-এ Lowercase বা ছোট হাতের অক্ষর ব্যবহার করার জন্য সমর্থন করে এবং XHTML এর মতো স্ট্রাইকার ডকুমেন্টের জন্য ছোট হাতের অক্ষরগুলি ব্যবহার করার সমর্থন করে।

            `]
          }
        ]
       
    },
    
    {
        id:3,
        category:'এইচটিএমএল এট্রিবিউট',
        title:`এইচটিএমএল এট্রিবিউট - HTML Attribute`,
        desc:['এট্রিবিউট হল এমন কিছু শব্দগুচ্ছ যা প্রথম অর্থাৎ শুরুর দিকের এইচটিএমএল এলিমেন্ট বা ট্যাগেও সাথে বসে এবং এইচটিএমএল এলিমেন্টের কাজের ওপর প্রভাব বিস্তার করে।',],
        titleTwo:[
          {
            head:`এট্রিবিউটের বৈশিষ্ট্য`,
            text:[`সকল এইচটিএমএল এলিমেন্টর এট্রিবিউট রয়েছে,`,`এট্রিবিউট এর নাম এবং মান বা value, এই ২টি অংশ নিয়ে একটি এইচটিএমএল এট্রিবিউট তৈরি হয়, নাম বা name, এলিমেন্টের প্রপার্টি নির্ধারণ করে এবং মান বা value সেই প্রপার্টির মান নির্ধারণ করে,`,
          `এইচটিএমএল সর্বদা শুরু বা start ট্যাগে উল্লেখ করা হয়,`,
        `একটি এইচটিএমএল ট্যাগ, এক বা একাধিক এট্রিবিউট ধারন করতে পারে,`,
      `এইচটিএমএল এট্রিবিউটের মান ডাবল ("") বা সিংগেল (' ') কোটেশন ছিনহ ব্যবহার করে লেখা হয়,`],
      input:[
        `উদাহরণ`, `<a href="https://www.google.com">This is a link.</a>`,
      ]
          },
          {
            head:`src এট্রিবিউট`,
            text:[`এইচটিএমএল ডকুমেন্টে <img> এবং <script> ট্যাগের সাথে মূল ফাইল এর সংযোগ করার জন্য src এট্রিবিউট ব্যবহার করা হয়। নিছে একটি উদাহরণ দেখুন।`],
            input:[
              `উদাহরণ`,

              `<img src="flower_image.jpg" />`

            ]
          },
          {
            head:`width এবং height এট্রিবিউট`,
            text:[`এইচটিএমএল ডকুমেন্টে কোন ছবির প্রস্থ বা width ও উচ্চতা বা height নির্ধারণ করার জন্য width এবং height এট্রিবিউট ব্যবহার করা হয়। নিচে এর একটি উদাহরণ দেখুন।`],
            input:[
              `উদাহরণ`,

              `<img src="flower_image.jpg" width="500" height="600">`
            ]
          },
          {
            head:`alt এট্রিবিউট`,
            text:[`কোন কারনে যদি ওয়েব পেজে নির্ধারিত ছবিটি প্রদর্শিত না হয়, তখন ছবিটির বিকল্প হিসেবে একটি লেখা, ওয়েব পেজে প্রদর্শিত হয়। এই লেখা বা text নির্ধারণ করার জন্য alt এট্রিবিউট ব্যবহার করা হয়। ছবি বা image টি বিদ্যমান না থাকলে Alt এট্রিবিউট ছবিটির স্থানে নিচের মত একটি লেখা বা text প্রদর্শন করে।`],
            input:[
              `উদাহরণ`,

                `<img src="img_girl.jpg" alt="Girl with a flower">`
            ]
          },
          {
            head:`style এট্রিবিউট`,
            text:[`style এট্রিবিউট ব্যবহার করে কোন এইচটিএমএল এলিমেন্টে স্টাইল যেমন - রঙ, ফন্ট, আকার ইত্যাদি যোগ করা যায়। নিছে একটি উদাহরন দেখুন।`],
            input:[
              `উদাহরণ`,

              `<p style="color:red">I am a paragraph</p>`
            ]
          }
        ],
   
    
    },
    {
        id:4,
        category:'এইচটিএমএল ডকটাইপ',
        title:`এইচটিএমএল ডকটাইপ - HTML Doctype`,
        desc:[``],
        titleTwo:[
          {
            head:`<!DOCTYPE> ডিক্লারেসন`,
            text:[`<!DOCTYPE> ডিক্লেয়ারেশন কোন এইচটিএমএল ডকুমেন্টের টাইপ অর্থাৎ এইচটিএমএল ডকুমেন্টটি এইচটিএমএল এর কোন সংস্করণে তৈরি টা নির্দেশ করে এবং একটি ওয়েব পেজকে সঠিকভাবে ব্রাউজারে প্রদর্শিত হতে সাহায্য করে। যে কোন একটি ওয়েব ডকুমেন্ট অর্থাৎ এইচটিএমএল ডকুমেন্টের এটিই সর্বপ্রথম ট্যাগ অর্থাৎ সকল এইচটিএমএল ট্যাগের প্রথমেই এই ট্যাগটি শুধুমাত্র একবার লিখতে হয়। এর কোন end বা closeing বা শেষ ট্যাগ নেই।`],
          },
          {
            head:`DOCTYPE নির্দেশ পদ্ধতি`,
            text:[`বিভিন্ন ধরনের ডকুমেন্ট টাইপ ও ভার্সন রয়েছে। তাই কোন ওয়েব পেজকে ব্রাউজারের সঠিকভাবে প্রদর্শনের জন্য ব্রাউজারকে টাইপ ও ভার্সন এই দুটি তথ্য জানাতে হয়। DOCTYPE ডিক্লেয়ারেশন কোন কেস-সেন্সিটিভ ট্যাগ নয়। তাই এই ট্যাগ উল্লেখ করতে ছোট বা বড় উভয় ধরনের অক্ষরই ব্যবহার করা যায়।`],
          },
          {
            head:`এইচটিএমএলের ৫ এর নির্দেশ পদ্ধতি`,
            text:[`এইচটিএমএলের ৫ এর জন্য <!DOCTYPE> ডিক্লেয়ারেশন পদ্ধতিটি নিছে দেখুন -`],
            input:[
              `উদাহরণ`,

              `<!DOCTYPE html>`
            ]
          }
        ]
      
   
    },
    {
        id:5,
        category:'এইচটিএমএল হেড',
        title:`এইচটিএমএল হেড - HTML Head`,
        desc:['এএইচটিএমএল ডকুমেন্ট এর প্রধান দুটি অংশের প্রথমটি হল হেড সেকশন এবং অন্যটি <body> . . . </body> সেকশন। একটি ওয়েব পেজ এর সমস্ত অদৃশ্যমান কন্টেন্ট যেমন - style, script, meta data ইত্যাদি এই হেড সেকশন এ রাখা হয়।',
        'এইচটিএমএল এর <head> . . . </head> এলিমেনটের মাঝে যে সকল ট্যাগ ব্যবহার করা যায় সেগুলো হল <title>, <base>, <link>, <meta>, <script> এবং <style>.',
      
    ],
    titleTwo:[
      {
        head:'এইচটিএমএল title এলিমেনট  :',
        text:[`<title> এলিমেনট কোন এইচটিএমএল ডকুমেন্ট এর শিরোনাম বা title প্রদর্শন করে। প্রতিটি এইচটিএমএল বা এক্সএইচটিএমএল ডকুমেন্টেই ভিন্ন ভিন্ন শিরোনাম বা title দিতে হয়। ওয়েব পেজের বিষয়বস্তুর ওপর title ট্যাগের মধ্যস্থিত লেখা নির্ধারিত হয়।`,
      `ব্রাউজার টুলবারে শিরোনাম বা title প্রদর্শন করে,`,
      `সার্চ ইঞ্জিনের সার্চ রেজাল্ট এ টাইটেল ট্যাগ প্রদর্শিত হয়,`,
      `যখন কোন ওয়েব পেজ favorite হিসেবে নির্বাচন করা হয়, তখন একটি শিরোনাম নির্ধারণ করে,`,
      `নিচে একটি সাধারণ এইচটিএমএল ডকুমেন্টে title ট্যাগ এর অবস্থান দেখুন -`
      ],
      input:[
       ` উদাহরণ`,

`<html>`,
`  <head>`,
    `<title>Title of the document</title>`,
`  </head>`,

 ` <body>`,

    `The content of the document......`,

 ` </body>`,
`</html>`
      ]
      },
      {
        head:`এইচটিএমএল link এলিমেনট`,
        text:[`একটি এইচটিএমএল ডকুমেন্ট এবং বহিঃস্থ কোন ফাইল যেমন - সিএসএস, জাভাস্ক্রিপ্ট ইত্যাদির মাঝে সম্পর্ক তৈরি করতে লিংক ট্যাগ ব্যবহার করা হয়।`,
      `নিচে একটি সাধারণ উদাহরন দেখুন-`],
      input:[
       ` <head>`,

  `<link rel="stylesheet" type="text/css" href="style.css" />`,

`</head>`
      ]
      },{
        head:`এইচটিএমএল meta এলিমেনট`,
        text:[`ডকুমেন্ট সম্পর্কিত বিভিন্ন তথ্য সংযুক্ত করার জন্য <meta> ট্যাগ ব্যবহার করা হয়। সাধারনত মেটা এলিমেনট ওয়েব পেজের বিষয়বস্তু, কীওয়ার্ড, ওয়েব সাইটের স্বত্বাধিকারী, সর্বশেষ আপডেট, ওয়েব পেজটি যে তৈরি করেছে তার নাম, ঠিকানা, ওয়েব অ্যাড্রেস ইত্যাদি বিভিন্ন data বা তথ্য সংযুক্ত করার জন্য ব্যবহার করা হয়।`]
      }
    ]
    },
    {
        id:6,
        category:'এইচটিএমএল বডী',
        title:`এইচটিএমএল বডী - HTML body`,
        desc:['এইচটিএমএল ডকুমেন্ট এর প্রধান দুটি অংশের দ্বিতীয়টি হল বডী সেকশন। একটি ওয়েব পেজ এর সমস্ত দৃশ্যমান অদৃশ্যমান কন্টেন্ট যেমন-text, image, table, form, heading, paragraph ইত্যাদি এই বডী সেকশন এ রাখা হয়। ওয়েব পেজ এ বডী সেকশন তৈরি করার জন্য <body>...</body> ট্যাগ ব্যবহার করা হয়। ওয়েব পেজ এর সমস্ত কন্টেন্টগুলো <body>...</body> ট্যাগের মাঝে অবস্থান করে। বডী সেকশন এর <body> ও </body> ট্যাগ দুটোই অপশনাল ট্যাগ।',
        '<body> ট্যাগের সাথে ৬ টি এট্রিবিউট ব্যবহার করা যায়। যথা - bgcolor, text, link, background, vlink ও alink',
        
    ],
    titleTwo:[
      {
        head:`bgcolor এট্রিবিউটের ব্যবহার`,
        text:[`বডী ট্যাগের সাথে bgcolor এট্রিবিউট ব্যবহার করে ওয়েব পেজের ব্যাকগ্রাউন্ডের রঙ পরিবর্তন করা যায়। নীচে একটি উদাহরন দেখুন -`],
        input:[
          `উদাহরণ`,

         ` <body bgcolor="lime"> `,
          
         ` <p> This is a paragraph. </p> `,
              
          `</body>`
        ]
      },
      {
        head:`background এট্রিবিউটের ব্যবহার`,
        text:[`background এট্রিবিউটের ব্যবহার করে ওয়েব পেজের ব্যাকগ্রাউন্ডে ইমেজ সংযোজন করা যায় । background এট্রিবিউট ব্যবহারের ফলে ওয়েব পেজের ব্যাকগ্রাউন্ডে ইমেজ প্রদর্শিত হবে। background এট্রিবিউট লেখার নিয়ম হল background="img_name.img_format" ।`,
        `যে সকল ইমেজ ফরম্যাট ওয়েবে ব্যবহার করতে পারবেন সেগুলো হল -`,
        `Graphic Interchange Format (gif)`,
        `Joint Photographic Experts Group (jpeg)`,
        `Portable Network Graphic (png)`,
        `indows Bitmap (bmp)`,
      ]
      },
      {
        head:'text এট্রিবিউটের ব্যবহার',
        text:[`text এট্রিবিউটের ব্যবহার করে ওয়েব পেজের সমস্ত টেক্সটের রঙ নির্ধারণ করা হয়। text এট্রিবিউটের ব্যবহারের ফলে <body> ও </body> ট্যাগের মধ্যেকার সমস্ত টেক্সট রঙ্গিং দেখাবে। text এট্রিবিউট লেখার নিয়ম হল text="blue"।`,
      `নীচে একটি উদাহরন দেখুন -`],
      input:[
        `উদাহরণ`,

        ` <body text="blue">`,

        `<p> This is a paragraph.</p>`,
	  
        ` </body>`
      ]
      }
    ]
    },
    {
        id:7,
        category:'এইচটিএমএল হেডিং',
        title:`এইচটিএমএল হেডিং ট্যাগ - HTML Heading Tag`,
        desc:['ওয়েব পেজে কোন হেডিং বা শিরোনাম তৈরি করার জন্য ব্যবহার করা হয় হেডিং ট্যাগ। একটি এইচটিএমএল ডকুমেনট এর জন্য হেডিং ট্যাগ খুব গুরত্তপূর্ণ।',
        'হেডিং কে এইচটিএমএল ডকুমেনটে লেখা হয় <h1> ... <h6> ট্যাগ দিয়ে। <h1> থেকে <h6> পর্যন্ত মোট ৬টি হেডিং ট্যাগ ক্রমান্বয়ে গুরত্তপূর্ণতা বহন করে অর্থাৎ <h1> ট্যাগটি সব থেকে গুরত্তপূর্ণ ও বড় আকৃতির এবং <h6> ট্যাগটি সবথেকে কম গুরত্তপূর্ণ ও ছোট আকৃতির।'
    ],
    titleTwo:[
       {
        head:'',
        text:[``],
        input:[
          `উদাহরণ`,

         ` <body> `,
          
         ` <h1> This is a heahing. </h1>`,
          `<h2> This is a heahing. </h2>`,
         ` <h3> This is a heahing. </h3>`,
        `  </body>`
        ]
       },
       {
        head:`সার্চ ইঞ্জিন হেডিং ব্যবহার করে`,
        text:[`হেডিং ট্যাগ সার্চ ইঞ্জিন এর জন্য খুব গুরত্তপূর্ণ। ওয়েব পেজ এর স্ত্রাকচার এবং কন্টেন্ট index করার জন্য সার্চ ইঞ্জিন হেডিংগুলো ব্যবহার করে।`,
      `হেডিং ট্যাগ কে শুধুমাত্র হেডিং এর জন্যই ব্যবহার করুন। টেক্সট বা লেখাকে বড় বা বোল্ড করার জন্য বা প্যারাগ্রাফ(Paragraph) এর জন্য নয়। h1 হেডিং কে মেইন হেডিং হিসেবে ব্যবহার করা উচিৎ, তারপর h2 হেডিং কে, তারপর h3 হেডিং কে এবং এভাবে ক্রমান্বয়ে h6 পর্যন্ত।`,
    ]
       },
       {
        head:`এইচটিএমএল লাইন ব্রেক ( <br/> ) ট্যাগ`,
        text:[`কোন প্যারাগ্রাফে নতূন প্যারাগ্রাফ ট্যাগ ব্যবহার করা ছাড়াই আপনি যদি একটি নতুন লাইন তৈরি করতে চান অর্থাৎ লাইন ব্রেক দিতে চান তবে আপনি ব্যবহার করতে পারেন <br/> ট্যাগটি।`,
    ],input:[
      `উদাহরণ`,

      `<body>`,
  `<h1> This is a heahing with <br /> a line break tag.</h1>	`,		
`</body>`
    ]
       },
    ]
    },
    {
        id:8,
        category:'এইচটিএমএল প্যারাগ্রাফ',
        title:`এইচটিএমএল প্যারাগ্রাফ ট্যাগ - HTML Paragraph Tag`,
        desc:['সাধারনত ওয়েব পেজে কোন অনুচ্ছেদ বা Paragraph প্রদর্শন করার জন্য প্যারাগ্রাফ ট্যাগ ব্যবহার করা হয়। অর্থাৎ এইচটিএমএল ডকুমেন্টে প্যারাগ্রাফ লেখা হয় <p> ট্যাগ ব্যবহার করে।',
        '<p> ট্যাগ দিয়ে শুরু করার পর প্যারাগ্রাফ এর শেষে ক্লোজিং ট্যাগ অর্থাৎ </p> দিতে হবে। যদিও অনেক ব্রাউযার এইচটিএমএল ডকুমেন্ট সঠিক ভাবেই প্রদর্শন করে, আপনি ক্লোজিং ট্যাগ অর্থাৎ </p> দিতে ভুলে গেলেও। তারপরও আপনার উচিৎ সবসময় ক্লোজিং ট্যাগ ব্যবহার করা।'
    ],
    titleTwo:[
      {
        head:``,
        text:[``],
        input:[
          `উদাহরণ`,

`<body>`,
`<p> This is a paragraph.</p>`,
`</body>`
        ]
      },
      {
        head:`এইচটিএমএলএ নন-ব্রেকিং স্পেস ( &nbsp; ) এর ব্যবহার`,
        text:[`এইচটিএমএল এ একাধিক স্পেস, কারেজ রিটার্ন, ট্যাব, ইত্যাদি পরিবর্তিত হয়ে শুধুমাত্র একটি স্পেস সৃষ্টি করে। আপনি code এ যতগুলোই স্পেস দিন না কেন আউটপুট এ মাত্র একটি স্পেসই পাবেন`],
        input:[
          `উদাহরণ`,

`<body>`,
`<p> This     is a     paragraph. </p>  `,
`</body>`
        ]
      },{
        text:['তাই আপনি যদি কোন text এর মাঝে অতিরিক্ত স্পেস তৈরি করতে চান তবে আপনাকে &nbsp; শব্দ টি ব্যবহার করতে হবে। আপনি যতগুলো স্পেস চান আপনাকে ততগুলো &nbsp ব্যবহার করতে হবে।'],
        input:[
          `উদাহরণ`,

          `<body>`,
          `<p> This &nbsp; &nbsp; is a &nbsp; &nbsp; paragraph. </p>  `,
          `</body>`
        ]
      }
    ]
    },
    {
        id:9,
        category:'এইচটিএমএল টেক্সট',
        title:`এইচটিএমএল টেক্সট ফরম্যাটিং - HTML Text Formatting`,
        desc:[''],
        titleTwo:[
          {
            head:`টেক্সট ফরম্যাটিং এলিমেন্ট`,
            text:[ 'এইচটিএমএল এর কতগুল ট্যাগ আছে, যেগুলো ব্যবহার করে কোন text এর স্টাইল সরাসরি পরিবর্তন করা যায়, এর জন্য কোন সিএসএস বা স্টাইল কোড ব্যবহার করার প্রয়োজন হয় না। এই ট্যাগগুলোকে একত্রে ফরম্যাটিং ট্যাগ বলে। যে সকল ফরম্যাটিং ট্যাগ এইচটিএমএল এ ব্যবহার করা হয় সেগুলো হল -',
            '<b> ... </b> - এই ট্যাগ, লেখাকে বোল্ড/গাঢ় স্টাইল প্রদান করে।,',
            '<em> ... </em> - কোন লেখাকে, এম্ফেসাইজ/গুরুত্বপূর্ণ টেক্সট রুপে প্রকাশ করে।',
            '<i> ... </i> - এই ট্যাগ, কোন লেখাকে ইটালিক স্টাইল রুপে তৈরি করে।',
            `<small> ... </small> - এই ট্যাগ, সাধারনের থেকে অপেক্ষাকৃত ছোট লেখা তৈরি করে।`,
           '<strong> ... </strong> - কোন লেখাকে গুরুত্বপূর্ণ রুপে প্রকাশ করে।',
           '<sub> ... </sub> - এই ট্যাগ, লেখাকে সাবস্ক্রিপ্ট স্টাইল রুপে প্রকাশ করে।',
           '<sup> ... </sup>- এই ট্যাগ, লেখাকে সুপারস্ক্রিপ্ট স্টাইল রুপে প্রকাশ করে।',
           '<ins> ... </ins> - এই ট্যাগ, লেখাকে ইনসারটেড স্টাইল রুপে প্রকাশ করে।',
           '<del> ... </del> - এই ট্যাগ, লেখাকে ডিলেটকৃত স্টাইল রুপে প্রকাশ করে।',
           '<mark> ... </mark> - এই ট্যাগ, কোন লেখাকে মার্ক/হাইলাইট করে প্রকাশ করে।',]
          },
          {
            head:`<b> এবং <strong> এলিমেন্ট`,
            text:['এইচটিএমএল <b> ট্যাগ দ্বারা লেখাকে বোল্ড/গাঢ় করে প্রকাশ করা হয়, কিন্তু এর দ্বারা ঐ লেখাটির অতিরিক্ত কোন প্রয়োজনীয়তা প্রকাশ করা হয় না।'],
            input:[
              `উদাহরণ`,

              `<b>This text is bold</b>`
            ]
          },{
            text:[ 'এইচটিএমএল <strong> ট্যাগ ব্যবহার করে কোন লেখাকে শুধু গাঢ় বা bold রুপেই যে প্রকাশ করা হয় না, বরং সার্চ ইঞ্জিনের কাছে লেখাটির অর্থগত গুররুত্তপুরনতা প্রকাশ করা হয়।',]
          },{
            head:`<i> এবং <em> এলিমেন্ট `,
            text:[ 'এইচটিএমএল <i> ট্যাগ ব্যবহার করে কোন লেখাকে ইটালিক/বাঁকা রুপে করা প্রকাশ করা হয়, কিন্তু এই ট্যাগ সার্চ ইঞ্জিনের কাছে, লেখাটির কোন বাড়তি গুরুত্ব প্রকাশ করে না।'],
            input:[
              `উদাহরণ`,

              `<i>This text is bold</i>`
            ]
          },
          {
            head:`<small> এলিমেন্ট `,
            text:[ 'কোন লেখাকে সাধারনের থেকে অপেক্ষাকৃত ছোট করে দেখানোর জন্য এইচটিএমএল <small> ট্যাগ ব্যবহার করা হয়।'],
            input:[
              `উদাহরণ`,

              `<h2>HTML <small>Small</small> Formatting</h2>`
            ]
          },
          {
            head:`<mark> এলিমেন্ট `,
            text:[ 'এইচটিএমএল <mark> ট্যাগ ব্যবহারের মাধ্যমে কোন টেক্সটকে হাইলাইট বা বিশেষ ভাবে চিহ্নিত করা হয়।'],
            input:[
              `উদাহরণ`,

    

              `<h1>This text is<mark>Marked</mark> Formatting</h1>`
            ]
          }
        ]
       

  
    },
    {
        id:10,
        category:'এইচটিএমএল Quotation',
        title:`এইচটিএমএল Quotation এবং Citation এলিমেন্ট`,
        desc:[  ``],
       titleTwo:[
        {
          head:`<q> এলিমেন্ট`,
          text:[`এইচটিএমএল <q> ট্যাগ ব্যবহার করে কোন লেখাকে উদ্ধৃতি রুপে দেখানো হয়। ওয়েব ব্রাউজার, <q> ... </q> ট্যাগের মধ্যস্থিত সকল লেখাকেই উদ্ধৃতি ( " " ) ছিনহের মাঝে প্রকাশ করে।`],
          input:[
            `উদাহরণ`,

            `<p><q>websschool.com</q> is a free bangla web design tutorial website.</p>`
          ]
        },{
          head:`<blockquote> এলিমেন্ট`,
          text:[`<blockquote> এলিমেন্টের মাধ্যমে অন্য কোন ওয়েবসাইট থেকে আনা তথ্যকে ঐ তথ্যের লিংক বা URL সহ উপস্থাপন করা হয়, যেখানে কেবল URL টা ওয়েব পেজে প্রদর্শিত হয় না, এইচটিএমএল কোডে অবস্থান করে।`,
        `ওয়েবপেজে প্রদর্শনের সময় ব্রাউজার <blockquote> ট্যাগের মধ্যস্থিত লেখাকে বা দিকে কিছুটা মার্জিন রেখে প্রদর্শন করে।`]
        },
        {
          head:`<abbr> এলিমেন্ট`,
          text:[`এইচটিএমএল <abbr> এলিমেন্ট কোন সংক্ষিপ্ত শব্দ বা সংক্ষিপ্ত শব্দের বিবরণ বা কোন বিশেষ কোন শব্দের বিস্তারিত বর্ণনা, মাউস হোভার এর দ্বারা একটি টুলটিপ এর মাঝে প্রদর্শন করে। এই ট্যাগ, ব্রাউজার, সার্চ-ইঞ্জিন ও অনুবাদকারী ওয়েব সফটওয়্যার গুলোকে, তার মধ্যস্থিত তথ্যকে গুরুত্বপূর্ণ বলে বিবেচিত করায়।`],
          input:[
            `উদাহরণ`,

`<p>The <abbr title="International Business Machines">IBM</abbr> was founded in June 16, 1911.`
          ]
        },
        {
          head:`<address> এলিমেন্ট`,
          text:[`এইচটিএমএল <address> ট্যাগ ব্যবহার করে, এইচটিএমএল ডকুমেন্ট অথবা আর্টিকেলের লেখক বা স্বত্বাধিকারীর ঠিকানা সম্পর্কিত তথ্য যুক্ত করা হয়।`,
        `<address> ... </address> ট্যাগের মধ্যস্থিত তথ্যগুলো সাধারণত ইটালিক স্টাইলে প্রদর্শিত হয়। প্রায় সকল ব্রাউজারই এই এলিমেন্টের আগে ও পরে একটি করে লাইন ব্রেক যুক্ত করে।`]
        }
       ]
 
    },
    {
        id:11,
        category:'এইচটিএমএল স্টাইল',
        title:`এইচটিএমএল স্টাইল - HTML Style`,
        desc:['এইচটিএমএল এলিমেনট গুলো স্টাইল করতে এইচটিএমএল এর style ট্যাগ ব্যবহার করা হয়।'],
        titleTwo:[
          {
            head:  'style এট্রিবিউট',
            text:[   'inline স্টাইল অর্থাৎ প্রতিটি এইচটিএমএল এলিমেনটের সাথে স্টাইল এট্রিবিউট ব্যবহার করে এইচটিএমএল কন্টেন্টগুলো কে style করা যায়। style এট্রিবিউটে প্রায় সিএসএসের সকল প্রোপার্টিই ব্যবহার করা যায়।',`নিচে এর সিনট্যাক্স দেখুন। এখানে property হল সিএসএস প্রপার্টি এবং value হল সিএসএস মান।`],
            input:[
              `সিনট্যাক্স`,
`<tagname style="property:value;">`
            ]
          },
          {
            head: 'লেখার রঙ নির্ধারণ   ',
            text:['style এট্রিবিউটে color প্রোপার্টি ব্যবহারের মাধ্যমে কোন এইচটিএমএল এলিমেন্টের লেখার রঙ নির্ধারণ করা যায়। নিচে একটি উদাহরণ দেখুন যেখানে style এট্রিবিউট এর মাধ্যমে লেখাগুলোর রঙ নির্ধারণ করা হয়েছে।'],
            input:[
              `উদাহরণ`,

`<h1 style="color: blue;">This is a heading with blue colour.</h1> `,

`<p style="color: red;">This is a paragraph with red colour.</p>`
            ]
          },
          {
            head: `লেখার ফন্ট নির্ধারণ  `,
            text:[ 'style এট্রিবিউটে font-family প্রোপার্টি বাবহারের মাধ্যমে এইচটিএমএল এলিমেন্ট যেমন কোন হেডিং বা কোন প্যারাগ্রাফের ফন্ট নির্ধারণ করা যায়। নিচে একটি উদাহরণ দেখুন।'],
            input:[
              `উদাহরণ`,

              `<h1style="font-family: verdana;">This is a heading with blue colour.</h1> `,
              
              `<p tyle="font-family: courier;">This is a paragraph with red colour.</p>`
            ]
          },
          {
            head: 'ব্যাকগ্রাউন্ডের রঙ নির্ধারণ ',
            text:[ 'style এট্রিবিউটে background-color প্রোপার্টি ব্যবহারের মাধ্যমে কোন এইচটিএমএল এলিমেন্টের ব্যাকগ্রাউন্ডের রঙ নির্ধারণ করা যায়। নিচে একটি উদাহরণ দেখুন। এই উদাহরনটিতে ওয়েব পেজের ব্যাকগ্রাউন্ডের রঙ নির্ধারিত হবে aliceblue.'],
            input:[
              `উদাহরণ`,

`<body style="background-color: aliceblue;">`,

`<h1>This is a heading.</h1>`,
`<p>This is a paragraph.</p>`,

`</body>`
            ]
          },
          {
            head:'লেখার অবস্থান নির্ধারণ  ',
            text:['style এট্রিবিউটে text-align প্রোপার্টি ব্যবহার করে এইচটিএমএল এর কোন টেক্সট এলিমেন্ট কন্টেন্টের অবস্থান নির্ধারণ করা যায়। নিচে এর একটি উদাহরণ দেখুন।:'],
            input:[
              `উদাহরণ`,

              `<h1 style="text-align: center;">Heading in center.</h1> `,
              
              `<p style="text-align: right;">Paragraph in Right.</p>`
            ]
          },
          {
            head:'লেখার আকার পরিবর্তন  ',
            text:[ 'style এট্রিবিউটে font-size প্রোপার্টি বাবহার করে কোন এইচটিএমএল টেক্সট এলিমেন্টের আকার নির্ধারণ করা করা যায়। নিচে এর একটি উদাহরণ দেখুন।'],
            input:[
              `উদাহরণ`,

       `<h1 style="font-size: 150%;">This is a heading</h1> `,
       
       `<p style="font-size: 20px;">This is a paragraph.</p>`
            ]
          },
          {
            head: 'ডেপ্রিকেটেড ট্যাগ এবং এট্রিবিউট  :',
            text:[`এইচটিএমএল ৪.০১ এ কতগুলো ট্যাগ এবং এট্রিবিউট ডেপ্রিকেট বা বাতিল করা হয়েছে। ডেপ্রিকেট বলতে বোঝায় যে এইচটিএমএলের পরবর্তী ভার্সনগুলোয় এই ট্যাগ এবং এট্রিবিউট ব্যবহার করা হবে না।`]
          }
        ]
      
  

    },
    {
        id:12,
        category:'এইচটিএমএল সিএসএস',
        title:`এইচটিএমএল সিএসএস - HTML CSS`,
        desc:['এইচটিএমএল এলিমেনটের স্টাইলিং এর জন্য সিএসএস ব্যবহার করা হয়। CSS এর পূর্ণরূপ হল Cascading Style Sheet.'],
        titleTwo:[
          {
            head: 'সিএসএস দিয়ে এইচটিএমএল স্টাইলিং  ',
            text:['সিএসএসের উদ্ভব হয়েছে এইচটিএমএল এলিমেনট স্টাইলিং এর জন্য। ৩ ভাবে এইচটিএমএল ডকুমেন্টে সিএসএস ব্যবহার করা যায়। যথা -,',
            'External অর্থাৎ আলাদা স্টাইল শীট ব্যবহার করে ( সিএসএস ফাইল ), ',
            'Internal অর্থাৎ এইচটিএমএলের হেড সেকশনে স্টাইল এলিমেনট ব্যবহার করে এবং',
            `Inline অর্থাৎ প্রতিটি এইচটিএমএল এলিমেনটের সাথে স্টাইল এট্রিবিউট ব্যবহার করে।`,
           'কোন এইচটিএমএল এলিমেন্টে সিএসএস প্রয়োগ করার সবচেয়ে সহজ এবং ভাল পন্থাটি হলো বহিঃস্থ বা external সিএসএস ফাইল ব্যবহার করা। আমাদের এই টিউটোরিয়ালের মধ্যে প্রায় সল্পল ক্ষেত্রেই আমরা ইনলাইন সিএসএস অর্থাৎ স্টাইল এট্রিবিউট এবং ইন্টার্নাল সিএসএস অর্থাৎ স্টাইল এলিমেনট ব্যবহার করেছি, কারণ এরফলে আপনি সহজে উদাহরণগুলো বুঝতে এবং অনুশীলন করতে পারবেন। ব্যাবহারিক ক্ষেত্রে আপনাকে অবশ্যই External সিএসএস ফাইল ব্যবহার করতে হবে।',]
          },
          {
            head:  'Inline স্টাইল  ',
            text:[ 'কোন একটি নির্দিষ্ট এইচটিএমএল এলিমেন্টকে অথবা অল্প কিছু স্টাইল কোড যা কেবল, ঐ এলিমিন্টের জন্যই প্রজজ্জ, এ সকল ক্ষেত্রে স্টাইল করার জন্য Inline স্টাইল ব্যবহার করা হয়। এর জন্য ঐ এলিমেন্টের সাথে style এট্রিবিউট ব্যবহার করা হয়। নিচের উদাহরণটি ব্রাউজারে open করলে <p> এলিমেন্টের টেক্সটের রঙ সবুজ দেখা যাবে।'],
            input:[
              `উদাহরণ`,

              `<h1 style="color: green;">This is a Heading with green colour.</h1>`
            ]
          },
          {
            head:'Internal স্টাইল  ',
            text:[ 'Internal স্টাইল করার জন্য এইচটিএমএল ডকুমেন্টের <head> সেকশনের মধ্যে <style> . . . </style> ট্যাগ ব্যবহার করা হয় এবং স্টাইল কোডগুলো এই <style> . . . </style> ট্যাগের মধ্যে লেখা হয়। সিএসএস স্টাইল কোড সহ <style> . . . </style> ট্যাগটি <body> . . . </body> ট্যাগের মাঝেও ব্যবহার করা যায়। নিচে এর একটি উদাহরণ দেখুন।'],
            input:[
              `উদাহরণ`,

             ` <!DOCTYPE html>`,
              `<html>`,
               ` <head>`,
               ` <style>`,
                `  body {background-color: GhostWhite;}`,
                 ` h1 {color: teal;}`,
                 ` p {color: blue;}`,
              `  </style>`,
               ` </head>`,
               	  ` <body>`,
              
                 ` <h1>This is a heading</h1>`,
                
                  `<p>This is a paragraph.</p>`,
              
               ` </body>`,
             ` </html>`
            ]
          },
          {
            head: 'External স্টাইল  ',
            text:[ 'এক সাথে অনেকগুলো ওয়েব পেজ অথবা একটি সম্পূর্ণ ওয়েবসাইটকে স্টাইল করার জন্য External সিএসএস পদ্ধতি ব্যবহার করা উচিৎ। অর্থাৎ এমন ক্ষেত্রে যেখানে একই রকম বেস কিছু সিএসএস স্টাইল কোড , এখাধিক এইচটিএমএল ডকুমেন্ট বা সমগ্র ওয়েব সাইটের জন্যই প্রযোজ্য।',
            'একটি সিএসএস ফাইল তৈরি করে তার মধ্যে প্রয়োজনীয় সকল স্টাইল কোড গুলো অন্তর্ভুক্ত করা হয়। তারপর ফাইলটিকে ডকুমেন্টের <head> সেক্সনের মাঝে <link> ট্যাগ ব্যবহার করে সংযুক্ত করে দেওয়া হয়। এইচটিএমএল এলিমেন্টে নির্দিষ্ট ক্লাস বা আইডি ব্যবহার করে External সিএসএস ফাইলের স্টাইল কোড গুলো সুনির্দিষ্ট ভাবে নির্দেশ করা যায়। এভাবে কোন স্টাইল শীট কোন ওয়েবসাইটের সকল ওয়েব পেজে সংযুক্ত করে পুরো ওয়েবসাইটের স্টাইল করা যায়।'],
            input:[
              `উদাহরণ`,

             ` <!DOCTYPE html>`,
              `<html>`,
               ` <head>`,
                ` <link rel="stylesheet" href="styles.css">`,
               ` </head>`,
               	  ` <body>`,
              
                 ` <h1>This is a heading</h1>`,
                
                  `<p>This is a paragraph.</p>`,
              
               ` </body>`,
             ` </html>`
            ]
          },
          {
            head:'id এট্রিবিউট  ',
            text:['কোনো নির্দিষ্ট একটি এলিমেন্টকে বিশেষভাবে স্টাইল করার জন্য এইচটিএমএল এলিমিন্টের মধ্যে id এট্রিবিউট যুক্ত করা হয়। অর্থাৎ এইচটিএমএল এলিমেন্টকে id এট্রিবিউট ব্যবহার করে একটি নাম দেয়া হয়।'],
            input:[
              `এইচটিএমএল কোড `, `<p id="p01">I am different</p>`
            ]
          },
          {
            text:['তারপরে ঐ নির্দিষ্ট id এট্রিবিউট যুক্ত এইচটিএমএল এলিমেন্টকে স্টাইল করার জন্য সিএসএস ফাইলে বা <style> . . . </style> এট্রিবিউটের অভ্যন্তরে স্টাইল কোড লেখা হয়।',
            ],
            input:[
              `#p01 {`,
               ` color: blue;`,
                `}`
            ]
          },
          {
            head: 'class এট্রিবিউট  ',
            text:[
              'একাধিক এইচটিএমএল এলিমেন্টকে একত্রে একই ধরনের স্টাইল করার জন্য class এট্রিবিউট ব্যবহার করা হয়। অর্থাৎ কতগুলো এইচটিএমএল এলিমেন্টকে class এট্রিবিউট ব্যবহার করে একটি সার্বজনীন সাধারণ নাম দেয়া হয়।'
            ],
            input:[
              `উদাহরণ`, `<p class="p01">I am different</p>`
            ]
          },
          {
            text:[ 'তারপরে ঐ class এট্রিবিউট যুক্ত এইচটিএমএল এলিমেন্ট গুলোকে স্টাইল করার জন্য class কে কল/সিলেক্ট করে সিএসএস ফাইলে স্টাইল নির্ধারণ করা হয়। তারপরে ঐ class এট্রিবিউট যুক্ত এইচটিএমএল এলিমেন্ট গুলোকে স্টাইল করার জন্য এই নাম ধরেই কল/সিলেক্ট করে সিএসএস ফাইলে বা <style> . . . </style> এট্রিবিউটের অভ্যন্তরে সিএসএস স্টাইল কোড গুলো লেখা হয়।'],
            input:[
              `.p01 {`,
               ` color: blue;`,
                `}`
            ]
          }
        ]

      

    },
    {
        id:13,
        category:'এইচটিএমএল আইডি',
        title:`এইচটিএমএল আইডি - HTML ID`,
        desc:['একটি আইডি বা ID এট্রিবিউট ব্যবহার করে প্রতিটি এইচটিএমএল এলিমেন্টের জন্য ইউনিক আইডি নির্ধারণ করা হয়। আইডি সিলেক্টর ব্যবহার করে কোন নির্দিষ্ট এইচটিএমএল এলিমেন্টে সিএসএস বা জাভাস্ক্রিপ্ট ব্যবহার করা যায়।'],
        titleTwo:[
          {
            head: 'আইডি এট্রিবিউট ব্যবহার  ',
            text:[ 'একটি আইডি এট্রিবিউট হল কোন এইচটিএমএল এলিমেন্টের জন্য নির্ধারিত একটি সতন্দ্র নাম। আইডি এট্রিবিউটের মান অর্থাৎ নামটি একদম ইউনিক হতে হয়। আইডি ব্যবহার করে কোন নির্দিষ্ট এইচটিএমএল এলিমেন্টে সিএসএস বা জাভাস্ক্রিপ্টের কাজগুলো সুনির্ধারিত ভাবে নির্ধারণ করে সম্পন্ন করা যায়।',
            'সিএসএস এ আইডি ব্যবহার করতে হলে একটি হ্যাস ছিনহ ( # ) ব্যবহার করতে হয় এবং তারপর আইডির নাম লিখতে হয়। নিচে উদাহরণ দেখুন।'],
            input:[
              `উদাহরণ`,

             ` <style>`,
            `    #myHeader {`,
                 ` background-color: silver;`,
                `  color: teal;`,
                 ` padding: 40px;`,
                 ` text-align: center;`,
               ` }`,
               ` </style>`,
                
                `<h1 id="myHeader">My Header</h1>`
            ]
          },
          {
            head:`ক্লাস এবং আইডি এর পার্থক্য  `,
            text:[  
              'একটি আইডি বা ID এট্রিবিউট ব্যবহার করে প্রতিটি এইচটিএমএল এলিমেন্টের জন্য একটি ইউনিক আইডি নির্ধারণ করা হয়, যেখানে কোন ক্লাস ব্যবহার করে একাধিক এলিমেন্টে একই ধরনের স্টাইল ব্যবহার করা যায়।'],
              input:[
                `উদাহরণ`,

              `  <style>`,
                 ` /* Style the element with the id "myHeader" */`,
                `  #myHeader {`,
                    `background-color: lightblue;`,
                   ` color: black;`,
                  `  padding: 40px;`,
                  `  text-align: center;`,
                `  }`,
                  
               `   /* Style all elements with the class name "city" */`,
                 ` .city {`,
              `      background-color: tomato;`,
                  `  color: white;`,
                  `  padding: 10px;`,
               `   }`,
                 ` </style>`,
                  
                `  <!-- A unique element -->`,
                 ` <h1 id="myHeader">My Cities</h1>`,
                
                 ` <!-- Multiple similar elements -->`,
                `  <h2 class="city">London</h2>`,
                `  <p>London is the capital of England.</p>`,
                
                 ` <h2 class="city">Paris</h2>`,
                 ` <p>Paris is the capital of France.</p>`,
                
                 ` <h2 class="city">Tokyo</h2>`,
                  `<p>Tokyo is the capital of Japan.</p>`,
              ]
          },
          {
            head: 'জাভাস্ক্রিপ্টে আইডি এট্রিবিউট ব্যবহার  ',
            text:[`getElementById() মেথড ব্যবহার করে জাভাস্ক্রিপ্ট নির্দিষ্ট কোন নামের আইডি যুক্ত এলিমেন্টে কাজ করতে পারে। নিচে এর উদাহরণ দেখুন।`],
            input:[
              `উদাহরণ`,

`<script>`,
  `function displayResult() {`,
  `document.getElementById("myHeader").innerHTML = "Have a nice day!";`,
  `}`,
 ` </script>`
            ]
          },
          {
           head:  'আইডি এবং লিংক ব্যবহার করে বুকমার্ক তৈরি ',
           text:[    'কোন ওয়েব পেজের নির্দিষ্ট কোন অংশে যেতে বুকমার্ক ব্যবহার করা হয়। বিশেষ করে ওয়েব পেজ যদি খুব দিরঘ হয়, তবে বুকমার্ক ভাল একটি সুবিধা। আইডি এবং লিংক ব্যবহার করে বুকমার্ক তৈরি করা হয়। এর জন্য প্রথমে একটি বুকমার্ক তৈরি করতে হয় এবং তারপরে এতে লিংক যুক্ত করতে হয়। নিচে একটি উদাহরন দেখুন।'],
           input:[
            `<h2 id="C4">Chapter 4</h2>`
           ]
          }
        ]
       
  
        
 
       
     
     
   
       
    
    },
    {
        id:14,
        category:'এইচটিএমএল কমেন্ট',
        title:`এইচটিএমএল কমেন্ট - HTML Comment`,
        desc:['কমেন্ট হল এইচটিএমএল ডকুমেন্টে এমন কোন বাড়তি সহায়ক তথ্য বা নোট, যা ব্রাউজারে প্রদর্শিত হবে না কিন্তু এইচটিএমএল কোডে থাকবে। এইচটিএমএল ডকুমেন্টে কমেন্ট যুক্ত করতে কমেন্ট ট্যাগ ব্যবহার করা হয়।'],
        titleTwo:[
          {
            head:  'কমেন্ট ট্যাগ  ',
            text:[ 'নিচের সিনট্যাক্স ব্যবহার করে একটি এইচটিএমএল ডকুমেন্টে কোন কমেন্ট লেখা যায়।'],
            input:[
              'সিনট্যাক্স  <!-- Write your comments here -->'
            ]
          },
          {
            text:[ `এইচটিএমএল ডিবাগ করার জন্য কমেন্ট একটি চমৎকার পদ্ধতি, কারণ আপনি ত্রুটিগুলির সন্ধান করতে এক সময়ে এক কোডের HTML লাইনে কমেন্ট করতে পারেন। নিচে একটি উদাহরণ দেখুন।`],
            input:[
              `উদাহরণ`,

              `<!-- Do not display this at the moment 
              
              <img border="0" src="flower.jpg" alt="Flower"> 
              
              -->`
            ]
          }
        ]
      
      
    
       

    },
    {
        id:15,
        category:'এইচটিএমএল রঙ',
        title:`এইচটিএমএল রঙ - HTML Colour`,
        desc:['এইচটিএমএল এ কোন লেখা, যেমন <h1>, <h2>, <p> ইত্যাদিতে color ও background-color প্রোপার্টি ব্যবহার করে রঙ নির্ধারণ করা যায়।'],
        titleTwo:[
          {
            head: 'টেক্সটের রঙ নির্ধারণ  ',
            text:[
              'নিছের উদাহরনে, এইচটিএমএল style এট্রিবিউটের বা <style> ট্যাগ এর মাধ্যমে color প্রোপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্তের রঙ নির্ধারণ করা হয়েছে।'
            ],
            input:[
              `উদাহরণ`,

             ` <h1 style="color:Tomato;">Hello World</h1>` ,
              
             ` <p style="color:DodgerBlue;">WebSschool.com</p> `,
              
             ` <p style="color:MediumSeaGreen;">Free Bangla Web Design Tutorials..</p>`
            ]
          },
          {
            head:'ব্যাকগ্রাউন্ডের রঙ   ',
            text:[`এইচটিএমএল style এট্রিবিউটের বা <style> ট্যাগ এর মাধ্যমে color এবং background-color প্রোপার্টি ব্যবহার করে কোন এইচটিএমএল এলিমেন্তের রঙ নির্ধারণ করা যায়।`],
            input:[
             ` উদাহরণ`,

             ` <h1 style="background-color: Tomato;">Hello World</h1> `,
              
              `<p style="background-color: DodgerBlue;">simple text...</p>`
            ]
          },
          {
            head: `রঙের মান নির্ধারণ  :`,
            text:[ 'এইচটিএমএল এ যে সকল পদ্ধতিতে রঙের নাম নির্ধারণ করা যায়, সেগুলো নিম্নরূপ।',
            'রঙের নাম',
            'হেক্সাডেসিমাল',
            'RGB',
            'HSL',
            'RGBA',
            'HSLA',]
          },
          {
            head:'রঙের নাম  ',
            text:['Tomato Orange DodgerBlue MediumSeaGreen Gray SlateBlue Violet LightGray',
            'এ ছাড়াও HTML এ আরও ১৪০ টি Standard বা আদর্শ রঙের নাম সরাসরি লিখে নির্ধারণ করা যায়']
          },
          {
            head:'রঙের মান ব্যবহার  ',
            text:['HTML এ রঙ প্রদর্শনের জন্য সরাসরি রঙের নাম না লিখেও হেক্সাডেসিমাল, RGB, HSL, RGBA ও HSLA পদ্ধতিগুলোতে রঙের নাম নির্ধারণ করা যায়।',
            'কোন এলিমেন্টের উপর মাউস হোভার করলে একটি টুলটিপ আকারে কোন লেখা প্রদর্শনের জন্য title এট্রিবিউট ব্যবহার করা হয়ে থাকে।'],
            input:[
              `উদাহরণ`, ` <p title="I'm a tooltip">`,
             ` This is a paragraph with a tooltip.`,
              `</p>`
            ]
          }
        ]
       
    
    },

]